; ModuleID = 'libjansson.so.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.json_t = type { i32, i64 }
%struct.hashtable = type { i64, %struct.hashtable_list*, i64, %struct.hashtable_list, %struct.hashtable_list }
%struct.hashtable_list = type { %struct.hashtable_list*, %struct.hashtable_list* }
%struct.strbuffer_t = type { i8*, i64, i64 }
%struct.key_len = type { i8*, i32 }
%struct.buffer = type { i64, i64, i8* }
%struct.json_error_t = type { i32, i32, i32, [80 x i8], [160 x i8] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.hashtable_pair = type { %struct.hashtable_list, %struct.hashtable_list, i64, %struct.json_t*, i64, [1 x i8] }
%struct.timeval = type { i64, i64 }
%struct.lex_t = type { %struct.stream_t, %struct.strbuffer_t, i64, i64, i32, %union.anon }
%struct.stream_t = type { i32 (i8*)*, i8*, [5 x i8], i64, i32, i32, i32, i32, i64 }
%union.anon = type { %struct.anon }
%struct.anon = type { i8*, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "whitespace", scope: !2, file: !3, line: 69, type: !109, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !17, globals: !108, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "dump.c", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/jansson/jansson-2.14/src", checksumkind: CSK_MD5, checksum: "f80677046fbc40bfda5c84fd3493bc0e")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 50, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./jansson.h", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/jansson/jansson-2.14/src", checksumkind: CSK_MD5, checksum: "b188f36c20fe029b4dd897c2a2c3b8c6")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16}
!9 = !DIEnumerator(name: "JSON_OBJECT", value: 0)
!10 = !DIEnumerator(name: "JSON_ARRAY", value: 1)
!11 = !DIEnumerator(name: "JSON_STRING", value: 2)
!12 = !DIEnumerator(name: "JSON_INTEGER", value: 3)
!13 = !DIEnumerator(name: "JSON_REAL", value: 4)
!14 = !DIEnumerator(name: "JSON_TRUE", value: 5)
!15 = !DIEnumerator(name: "JSON_FALSE", value: 6)
!16 = !DIEnumerator(name: "JSON_NULL", value: 7)
!17 = !{!18, !19, !32, !39, !96, !97, !100, !7}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "strbuffer_t", file: !21, line: 18, baseType: !22)
!21 = !DIFile(filename: "./strbuffer.h", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/jansson/jansson-2.14/src", checksumkind: CSK_MD5, checksum: "48cb9898c352a758b5284f166b8f1821")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 14, size: 192, elements: !23)
!23 = !{!24, !27, !31}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !22, file: !21, line: 15, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !22, file: !21, line: 16, baseType: !28, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !29, line: 46, baseType: !30)
!29 = !DIFile(filename: "node_modules/llvm-14.0.0.obj/lib/clang/14.0.0/include/stddef.h", directory: "/home/kansx", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!30 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !22, file: !21, line: 17, baseType: !28, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buffer", file: !3, line: 32, size: 192, elements: !34)
!34 = !{!35, !37, !38}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !33, file: !3, line: 33, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !33, file: !3, line: 34, baseType: !28, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !33, file: !3, line: 35, baseType: !25, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !41, line: 7, baseType: !42)
!41 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !43, line: 49, size: 1728, elements: !44)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!44 = !{!45, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !61, !63, !64, !65, !69, !71, !73, !77, !80, !82, !85, !88, !89, !90, !91, !92}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !42, file: !43, line: 51, baseType: !46, size: 32)
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !42, file: !43, line: 54, baseType: !25, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !42, file: !43, line: 55, baseType: !25, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !42, file: !43, line: 56, baseType: !25, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !42, file: !43, line: 57, baseType: !25, size: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !42, file: !43, line: 58, baseType: !25, size: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !42, file: !43, line: 59, baseType: !25, size: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !42, file: !43, line: 60, baseType: !25, size: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !42, file: !43, line: 61, baseType: !25, size: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !42, file: !43, line: 64, baseType: !25, size: 64, offset: 576)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !42, file: !43, line: 65, baseType: !25, size: 64, offset: 640)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !42, file: !43, line: 66, baseType: !25, size: 64, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !42, file: !43, line: 68, baseType: !59, size: 64, offset: 768)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !43, line: 36, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !42, file: !43, line: 70, baseType: !62, size: 64, offset: 832)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !42, file: !43, line: 72, baseType: !46, size: 32, offset: 896)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !42, file: !43, line: 73, baseType: !46, size: 32, offset: 928)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !42, file: !43, line: 74, baseType: !66, size: 64, offset: 960)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !67, line: 152, baseType: !68)
!67 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!68 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !42, file: !43, line: 77, baseType: !70, size: 16, offset: 1024)
!70 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !42, file: !43, line: 78, baseType: !72, size: 8, offset: 1040)
!72 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !42, file: !43, line: 79, baseType: !74, size: 8, offset: 1048)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 1)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !42, file: !43, line: 81, baseType: !78, size: 64, offset: 1088)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !43, line: 43, baseType: null)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !42, file: !43, line: 89, baseType: !81, size: 64, offset: 1152)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !67, line: 153, baseType: !68)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !42, file: !43, line: 91, baseType: !83, size: 64, offset: 1216)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !43, line: 37, flags: DIFlagFwdDecl)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !42, file: !43, line: 92, baseType: !86, size: 64, offset: 1280)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !43, line: 38, flags: DIFlagFwdDecl)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !42, file: !43, line: 93, baseType: !62, size: 64, offset: 1344)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !42, file: !43, line: 94, baseType: !18, size: 64, offset: 1408)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !42, file: !43, line: 95, baseType: !28, size: 64, offset: 1472)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !42, file: !43, line: 96, baseType: !46, size: 32, offset: 1536)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !42, file: !43, line: 98, baseType: !93, size: 160, offset: 1568)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 20)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !98, line: 77, baseType: !99)
!98 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !67, line: 194, baseType: !68)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_t", file: !6, line: 64, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "json_t", file: !6, line: 61, size: 128, elements: !103)
!103 = !{!104, !106}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !102, file: !6, line: 62, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_type", file: !6, line: 59, baseType: !5)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !102, file: !6, line: 63, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !28)
!108 = !{!0}
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 264, elements: !111)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!111 = !{!112}
!112 = !DISubrange(count: 33)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "seed_initialized", scope: !115, file: !116, line: 197, type: !126, isLocal: true, isDefinition: true)
!115 = distinct !DICompileUnit(language: DW_LANG_C99, file: !116, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !117, globals: !122, splitDebugInlining: false, nameTableKind: None)
!116 = !DIFile(filename: "hashtable_seed.c", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/jansson/jansson-2.14/src", checksumkind: CSK_MD5, checksum: "a4daa8076d361c901c7c812201dae3f5")
!117 = !{!118, !121, !18}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !119, line: 26, baseType: !120)
!119 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !67, line: 42, baseType: !7)
!121 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!122 = !{!123, !113}
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "hashtable_seed", scope: !115, file: !116, line: 194, type: !125, isLocal: false, isDefinition: true)
!125 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !118)
!126 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !26)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "do_malloc", scope: !129, file: !130, line: 20, type: !139, isLocal: true, isDefinition: true)
!129 = distinct !DICompileUnit(language: DW_LANG_C99, file: !130, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !131, globals: !132, splitDebugInlining: false, nameTableKind: None)
!130 = !DIFile(filename: "memory.c", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/jansson/jansson-2.14/src", checksumkind: CSK_MD5, checksum: "091b8e1eae43d97a276439668f10812c")
!131 = !{!18}
!132 = !{!127, !133}
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "do_free", scope: !129, file: !130, line: 21, type: !135, isLocal: true, isDefinition: true)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_free_t", file: !6, line: 405, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !18}
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_malloc_t", file: !6, line: 404, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!18, !28}
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "type_names", scope: !145, file: !146, line: 37, type: !175, isLocal: true, isDefinition: true)
!145 = distinct !DICompileUnit(language: DW_LANG_C99, file: !146, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !147, retainedTypes: !168, globals: !169, splitDebugInlining: false, nameTableKind: None)
!146 = !DIFile(filename: "pack_unpack.c", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/jansson/jansson-2.14/src", checksumkind: CSK_MD5, checksum: "458d4605fe2a7973612bdfbc1519569f")
!147 = !{!5, !148}
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "json_error_code", file: !6, line: 160, baseType: !7, size: 32, elements: !149)
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167}
!150 = !DIEnumerator(name: "json_error_unknown", value: 0)
!151 = !DIEnumerator(name: "json_error_out_of_memory", value: 1)
!152 = !DIEnumerator(name: "json_error_stack_overflow", value: 2)
!153 = !DIEnumerator(name: "json_error_cannot_open_file", value: 3)
!154 = !DIEnumerator(name: "json_error_invalid_argument", value: 4)
!155 = !DIEnumerator(name: "json_error_invalid_utf8", value: 5)
!156 = !DIEnumerator(name: "json_error_premature_end_of_input", value: 6)
!157 = !DIEnumerator(name: "json_error_end_of_input_expected", value: 7)
!158 = !DIEnumerator(name: "json_error_invalid_syntax", value: 8)
!159 = !DIEnumerator(name: "json_error_invalid_format", value: 9)
!160 = !DIEnumerator(name: "json_error_wrong_type", value: 10)
!161 = !DIEnumerator(name: "json_error_null_character", value: 11)
!162 = !DIEnumerator(name: "json_error_null_value", value: 12)
!163 = !DIEnumerator(name: "json_error_null_byte_in_key", value: 13)
!164 = !DIEnumerator(name: "json_error_duplicate_key", value: 14)
!165 = !DIEnumerator(name: "json_error_numeric_overflow", value: 15)
!166 = !DIEnumerator(name: "json_error_item_not_found", value: 16)
!167 = !DIEnumerator(name: "json_error_index_out_of_range", value: 17)
!168 = !{!25, !28, !46, !30, !68}
!169 = !{!170, !143}
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "unpack_value_starters", scope: !145, file: !146, line: 42, type: !172, isLocal: true, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 96, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 12)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 512, elements: !178)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!178 = !{!179}
!179 = !DISubrange(count: 8)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "the_true", scope: !182, file: !183, line: 978, type: !187, isLocal: true, isDefinition: true)
!182 = distinct !DISubprogram(name: "json_true", scope: !183, file: !183, line: 977, type: !184, scopeLine: 977, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !192, retainedNodes: !264)
!183 = !DIFile(filename: "value.c", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/jansson/jansson-2.14/src", checksumkind: CSK_MD5, checksum: "5868e9c817d9d5db0c1a737425a5f3cc")
!184 = !DISubroutineType(types: !185)
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_t", file: !6, line: 64, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "json_t", file: !6, line: 61, size: 128, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !188, file: !6, line: 62, baseType: !105, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !188, file: !6, line: 63, baseType: !107, size: 64, offset: 64)
!192 = distinct !DICompileUnit(language: DW_LANG_C99, file: !183, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !193, globals: !260, splitDebugInlining: false, nameTableKind: None)
!193 = !{!194, !25, !18, !186, !220, !229, !238, !28, !245, !253, !259}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_object_t", file: !196, line: 38, baseType: !197)
!196 = !DIFile(filename: "./jansson_private.h", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/jansson/jansson-2.14/src", checksumkind: CSK_MD5, checksum: "8a1962d519b33addbe26db22f892ceff")
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 35, size: 576, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "json", scope: !197, file: !196, line: 36, baseType: !187, size: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "hashtable", scope: !197, file: !196, line: 37, baseType: !201, size: 448, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtable_t", file: !202, line: 42, baseType: !203)
!202 = !DIFile(filename: "./hashtable.h", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/jansson/jansson-2.14/src", checksumkind: CSK_MD5, checksum: "94af52dbf3fc9ddd779f93851bd22b4b")
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable", file: !202, line: 36, size: 448, elements: !204)
!204 = !{!205, !206, !217, !218, !219}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !203, file: !202, line: 37, baseType: !28, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !203, file: !202, line: 38, baseType: !207, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_bucket", file: !202, line: 31, size: 128, elements: !209)
!209 = !{!210, !216}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !208, file: !202, line: 32, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_list", file: !202, line: 14, size: 128, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !212, file: !202, line: 15, baseType: !211, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !212, file: !202, line: 16, baseType: !211, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !208, file: !202, line: 33, baseType: !211, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !203, file: !202, line: 39, baseType: !28, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !203, file: !202, line: 40, baseType: !212, size: 128, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ordered_list", scope: !203, file: !202, line: 41, baseType: !212, size: 128, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_pair", file: !202, line: 22, size: 512, elements: !222)
!222 = !{!223, !224, !225, !226, !227, !228}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !221, file: !202, line: 23, baseType: !212, size: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ordered_list", scope: !221, file: !202, line: 24, baseType: !212, size: 128, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !221, file: !202, line: 25, baseType: !28, size: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !221, file: !202, line: 26, baseType: !186, size: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "key_len", scope: !221, file: !202, line: 27, baseType: !28, size: 64, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !221, file: !202, line: 28, baseType: !74, size: 8, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_array_t", file: !196, line: 45, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 40, size: 320, elements: !232)
!232 = !{!233, !234, !235, !236}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "json", scope: !231, file: !196, line: 41, baseType: !187, size: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !231, file: !196, line: 42, baseType: !28, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !231, file: !196, line: 43, baseType: !28, size: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !231, file: !196, line: 44, baseType: !237, size: 64, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_string_t", file: !196, line: 51, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 47, size: 256, elements: !241)
!241 = !{!242, !243, !244}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "json", scope: !240, file: !196, line: 48, baseType: !187, size: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !240, file: !196, line: 49, baseType: !25, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !240, file: !196, line: 50, baseType: !28, size: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_integer_t", file: !196, line: 61, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 58, size: 192, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "json", scope: !247, file: !196, line: 59, baseType: !187, size: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !247, file: !196, line: 60, baseType: !251, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_int_t", file: !6, line: 73, baseType: !252)
!252 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_real_t", file: !196, line: 56, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 53, size: 192, elements: !256)
!256 = !{!257, !258}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "json", scope: !255, file: !196, line: 54, baseType: !187, size: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !255, file: !196, line: 55, baseType: !259, size: 64, offset: 128)
!259 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!260 = !{!180, !261, !265}
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "the_false", scope: !263, file: !183, line: 983, type: !187, isLocal: true, isDefinition: true)
!263 = distinct !DISubprogram(name: "json_false", scope: !183, file: !183, line: 982, type: !184, scopeLine: 982, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !192, retainedNodes: !264)
!264 = !{}
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "the_null", scope: !267, file: !183, line: 988, type: !187, isLocal: true, isDefinition: true)
!267 = distinct !DISubprogram(name: "json_null", scope: !183, file: !183, line: 987, type: !184, scopeLine: 987, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !192, retainedNodes: !264)
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !270, retainedTypes: !271, splitDebugInlining: false, nameTableKind: None)
!269 = !DIFile(filename: "error.c", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/jansson/jansson-2.14/src", checksumkind: CSK_MD5, checksum: "57327d29149c695e1ebd0efdb06fecae")
!270 = !{!148}
!271 = !{!46}
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !274, splitDebugInlining: false, nameTableKind: None)
!273 = !DIFile(filename: "hashtable.c", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/jansson/jansson-2.14/src", checksumkind: CSK_MD5, checksum: "1a29dbcf1b6154a481a209e20a5bd2ba")
!274 = !{!28, !18, !275, !282, !25, !118, !298, !300, !304}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_t", file: !273, line: 27, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_list", file: !202, line: 14, size: 128, elements: !278)
!278 = !{!279, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !277, file: !202, line: 15, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !202, line: 16, baseType: !280, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "pair_t", file: !273, line: 28, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_pair", file: !202, line: 22, size: 512, elements: !285)
!285 = !{!286, !287, !288, !289, !296, !297}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !284, file: !202, line: 23, baseType: !277, size: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ordered_list", scope: !284, file: !202, line: 24, baseType: !277, size: 128, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !284, file: !202, line: 25, baseType: !28, size: 64, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !284, file: !202, line: 26, baseType: !290, size: 64, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_t", file: !6, line: 64, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "json_t", file: !6, line: 61, size: 128, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !292, file: !6, line: 62, baseType: !105, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !292, file: !6, line: 63, baseType: !107, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "key_len", scope: !284, file: !202, line: 27, baseType: !28, size: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !284, file: !202, line: 28, baseType: !74, size: 8, offset: 448)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !119, line: 25, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !67, line: 40, baseType: !70)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !119, line: 24, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !67, line: 38, baseType: !121)
!308 = distinct !DICompileUnit(language: DW_LANG_C99, file: !309, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !147, retainedTypes: !310, splitDebugInlining: false, nameTableKind: None)
!309 = !DIFile(filename: "load.c", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/jansson/jansson-2.14/src", checksumkind: CSK_MD5, checksum: "ea4e16b4d24e43fc3339df697bb06cf0")
!310 = !{!18, !311, !315, !121, !46, !321, !25, !28}
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_func", file: !309, line: 52, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!46, !18}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "string_data_t", file: !309, line: 888, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 885, size: 128, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !317, file: !309, line: 886, baseType: !177, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !317, file: !309, line: 887, baseType: !28, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "lex_t", file: !309, line: 79, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 65, size: 960, elements: !324)
!324 = !{!325, !341, !348, !349, !350, !351}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !323, file: !309, line: 66, baseType: !326, size: 448)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream_t", file: !309, line: 63, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 54, size: 448, elements: !328)
!328 = !{!329, !330, !331, !335, !336, !337, !338, !339, !340}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !327, file: !309, line: 55, baseType: !311, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !327, file: !309, line: 56, baseType: !18, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !327, file: !309, line: 57, baseType: !332, size: 40, offset: 128)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 40, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 5)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pos", scope: !327, file: !309, line: 58, baseType: !28, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !327, file: !309, line: 59, baseType: !46, size: 32, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !327, file: !309, line: 60, baseType: !46, size: 32, offset: 288)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !327, file: !309, line: 61, baseType: !46, size: 32, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "last_column", scope: !327, file: !309, line: 61, baseType: !46, size: 32, offset: 352)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !327, file: !309, line: 62, baseType: !28, size: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "saved_text", scope: !323, file: !309, line: 67, baseType: !342, size: 192, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "strbuffer_t", file: !21, line: 18, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 14, size: 192, elements: !344)
!344 = !{!345, !346, !347}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !343, file: !21, line: 15, baseType: !25, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !343, file: !21, line: 16, baseType: !28, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !343, file: !21, line: 17, baseType: !28, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !323, file: !309, line: 68, baseType: !28, size: 64, offset: 640)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !323, file: !309, line: 69, baseType: !28, size: 64, offset: 704)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !323, file: !309, line: 70, baseType: !46, size: 32, offset: 768)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !323, file: !309, line: 78, baseType: !352, size: 128, offset: 832)
!352 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !323, file: !309, line: 71, size: 128, elements: !353)
!353 = !{!354, !359, !360}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !352, file: !309, line: 75, baseType: !355, size: 128)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !352, file: !309, line: 72, size: 128, elements: !356)
!356 = !{!357, !358}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !355, file: !309, line: 73, baseType: !25, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !355, file: !309, line: 74, baseType: !28, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !352, file: !309, line: 76, baseType: !251, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !352, file: !309, line: 77, baseType: !259, size: 64)
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !363, splitDebugInlining: false, nameTableKind: None)
!362 = !DIFile(filename: "strbuffer.c", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/jansson/jansson-2.14/src", checksumkind: CSK_MD5, checksum: "753d550e8c4654b6b8263899904a2e6d")
!363 = !{!28}
!364 = distinct !DICompileUnit(language: DW_LANG_C99, file: !365, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !366, splitDebugInlining: false, nameTableKind: None)
!365 = !DIFile(filename: "strconv.c", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/jansson/jansson-2.14/src", checksumkind: CSK_MD5, checksum: "ec685dbd75d719e8a0339f783d150bf5")
!366 = !{!28, !18, !46}
!367 = distinct !DICompileUnit(language: DW_LANG_C99, file: !368, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !369, splitDebugInlining: false, nameTableKind: None)
!368 = !DIFile(filename: "utf.c", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/jansson/jansson-2.14/src", checksumkind: CSK_MD5, checksum: "a529d4adcd8a483f0ab690f6db0d9c6a")
!369 = !{!26, !121}
!370 = distinct !DICompileUnit(language: DW_LANG_C99, file: !371, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!371 = !DIFile(filename: "version.c", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/jansson/jansson-2.14/src", checksumkind: CSK_MD5, checksum: "a8503f9ddde07cf6357589e50db0145f")
!372 = !{!"clang version 14.0.0"}
!373 = !{i32 7, !"Dwarf Version", i32 5}
!374 = !{i32 2, !"Debug Info Version", i32 3}
!375 = !{i32 1, !"wchar_size", i32 4}
!376 = !{i32 7, !"PIC Level", i32 2}
!377 = !{i32 7, !"uwtable", i32 1}
!378 = distinct !DISubprogram(name: "json_dumps", scope: !3, file: !3, line: 426, type: !379, scopeLine: 426, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !383)
!379 = !DISubroutineType(types: !380)
!380 = !{!25, !381, !28}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!383 = !{!384, !385, !386, !387}
!384 = !DILocalVariable(name: "json", arg: 1, scope: !378, file: !3, line: 426, type: !381)
!385 = !DILocalVariable(name: "flags", arg: 2, scope: !378, file: !3, line: 426, type: !28)
!386 = !DILocalVariable(name: "strbuff", scope: !378, file: !3, line: 427, type: !20)
!387 = !DILocalVariable(name: "result", scope: !378, file: !3, line: 428, type: !25)
!388 = !DILocation(line: 0, scope: !378)
!389 = !DILocation(line: 427, column: 5, scope: !378)
!390 = !DILocation(line: 427, column: 17, scope: !378)
!391 = !DILocation(line: 430, column: 9, scope: !392)
!392 = distinct !DILexicalBlock(scope: !378, file: !3, line: 430, column: 9)
!393 = !DILocation(line: 430, column: 9, scope: !378)
!394 = !DILocalVariable(name: "json", arg: 1, scope: !395, file: !3, line: 474, type: !381)
!395 = distinct !DISubprogram(name: "json_dump_callback", scope: !3, file: !3, line: 474, type: !396, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !402)
!396 = !DISubroutineType(types: !397)
!397 = !{!46, !381, !398, !18, !28}
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_dump_callback_t", file: !6, line: 392, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!46, !177, !28, !18}
!402 = !{!394, !403, !404, !405, !406, !407}
!403 = !DILocalVariable(name: "callback", arg: 2, scope: !395, file: !3, line: 474, type: !398)
!404 = !DILocalVariable(name: "data", arg: 3, scope: !395, file: !3, line: 474, type: !18)
!405 = !DILocalVariable(name: "flags", arg: 4, scope: !395, file: !3, line: 475, type: !28)
!406 = !DILocalVariable(name: "res", scope: !395, file: !3, line: 476, type: !46)
!407 = !DILocalVariable(name: "parents_set", scope: !395, file: !3, line: 477, type: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtable_t", file: !202, line: 42, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable", file: !202, line: 36, size: 448, elements: !410)
!410 = !{!411, !412, !423, !424, !425}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !409, file: !202, line: 37, baseType: !28, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !409, file: !202, line: 38, baseType: !413, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_bucket", file: !202, line: 31, size: 128, elements: !415)
!415 = !{!416, !422}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !414, file: !202, line: 32, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_list", file: !202, line: 14, size: 128, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !418, file: !202, line: 15, baseType: !417, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !418, file: !202, line: 16, baseType: !417, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !414, file: !202, line: 33, baseType: !417, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !409, file: !202, line: 39, baseType: !28, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !409, file: !202, line: 40, baseType: !418, size: 128, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ordered_list", scope: !409, file: !202, line: 41, baseType: !418, size: 128, offset: 320)
!426 = !DILocation(line: 0, scope: !395, inlinedAt: !427)
!427 = distinct !DILocation(line: 433, column: 9, scope: !428)
!428 = distinct !DILexicalBlock(scope: !378, file: !3, line: 433, column: 9)
!429 = !DILocation(line: 477, column: 5, scope: !395, inlinedAt: !427)
!430 = !DILocation(line: 477, column: 17, scope: !395, inlinedAt: !427)
!431 = !DILocation(line: 479, column: 17, scope: !432, inlinedAt: !427)
!432 = distinct !DILexicalBlock(scope: !395, file: !3, line: 479, column: 9)
!433 = !DILocation(line: 479, column: 9, scope: !395, inlinedAt: !427)
!434 = !DILocation(line: 480, column: 14, scope: !435, inlinedAt: !427)
!435 = distinct !DILexicalBlock(scope: !436, file: !3, line: 480, column: 13)
!436 = distinct !DILexicalBlock(scope: !432, file: !3, line: 479, column: 37)
!437 = !{!438, !439, i64 0}
!438 = !{!"json_t", !439, i64 0, !441, i64 8}
!439 = !{!"omnipotent char", !440, i64 0}
!440 = !{!"Simple C/C++ TBAA"}
!441 = !{!"long", !439, i64 0}
!442 = !DILocation(line: 480, column: 34, scope: !435, inlinedAt: !427)
!443 = !DILocation(line: 484, column: 9, scope: !444, inlinedAt: !427)
!444 = distinct !DILexicalBlock(scope: !395, file: !3, line: 484, column: 9)
!445 = !DILocation(line: 484, column: 9, scope: !395, inlinedAt: !427)
!446 = !DILocation(line: 490, column: 1, scope: !395, inlinedAt: !427)
!447 = !DILocation(line: 433, column: 9, scope: !378)
!448 = !DILocation(line: 486, column: 11, scope: !395, inlinedAt: !427)
!449 = !DILocation(line: 487, column: 5, scope: !395, inlinedAt: !427)
!450 = !DILocation(line: 433, column: 9, scope: !428)
!451 = !DILocation(line: 436, column: 31, scope: !428)
!452 = !DILocation(line: 436, column: 18, scope: !428)
!453 = !DILocation(line: 0, scope: !428)
!454 = !DILocation(line: 438, column: 5, scope: !378)
!455 = !DILocation(line: 439, column: 5, scope: !378)
!456 = !DILocation(line: 440, column: 1, scope: !378)
!457 = distinct !DISubprogram(name: "dump_to_strbuffer", scope: !3, file: !3, line: 38, type: !400, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !458)
!458 = !{!459, !460, !461}
!459 = !DILocalVariable(name: "buffer", arg: 1, scope: !457, file: !3, line: 38, type: !177)
!460 = !DILocalVariable(name: "size", arg: 2, scope: !457, file: !3, line: 38, type: !28)
!461 = !DILocalVariable(name: "data", arg: 3, scope: !457, file: !3, line: 38, type: !18)
!462 = !DILocation(line: 0, scope: !457)
!463 = !DILocation(line: 39, column: 35, scope: !457)
!464 = !DILocation(line: 39, column: 12, scope: !457)
!465 = !DILocation(line: 39, column: 5, scope: !457)
!466 = distinct !DISubprogram(name: "do_dump", scope: !3, file: !3, line: 215, type: !467, scopeLine: 216, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !470)
!467 = !DISubroutineType(types: !468)
!468 = !{!46, !381, !28, !46, !469, !398, !18}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!470 = !{!471, !472, !473, !474, !475, !476, !477, !478, !484, !485, !487, !488, !489, !491, !492, !496, !497, !499, !500, !501, !502, !503, !511, !512, !513, !515, !521, !522, !525, !526}
!471 = !DILocalVariable(name: "json", arg: 1, scope: !466, file: !3, line: 215, type: !381)
!472 = !DILocalVariable(name: "flags", arg: 2, scope: !466, file: !3, line: 215, type: !28)
!473 = !DILocalVariable(name: "depth", arg: 3, scope: !466, file: !3, line: 215, type: !46)
!474 = !DILocalVariable(name: "parents", arg: 4, scope: !466, file: !3, line: 215, type: !469)
!475 = !DILocalVariable(name: "dump", arg: 5, scope: !466, file: !3, line: 216, type: !398)
!476 = !DILocalVariable(name: "data", arg: 6, scope: !466, file: !3, line: 216, type: !18)
!477 = !DILocalVariable(name: "embed", scope: !466, file: !3, line: 217, type: !46)
!478 = !DILocalVariable(name: "buffer", scope: !479, file: !3, line: 235, type: !481)
!479 = distinct !DILexicalBlock(scope: !480, file: !3, line: 234, column: 28)
!480 = distinct !DILexicalBlock(scope: !466, file: !3, line: 224, column: 32)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 800, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 100)
!484 = !DILocalVariable(name: "size", scope: !479, file: !3, line: 236, type: !46)
!485 = !DILocalVariable(name: "buffer", scope: !486, file: !3, line: 247, type: !481)
!486 = distinct !DILexicalBlock(scope: !480, file: !3, line: 246, column: 25)
!487 = !DILocalVariable(name: "size", scope: !486, file: !3, line: 248, type: !46)
!488 = !DILocalVariable(name: "value", scope: !486, file: !3, line: 249, type: !259)
!489 = !DILocalVariable(name: "n", scope: !490, file: !3, line: 264, type: !28)
!490 = distinct !DILexicalBlock(scope: !480, file: !3, line: 263, column: 26)
!491 = !DILocalVariable(name: "i", scope: !490, file: !3, line: 265, type: !28)
!492 = !DILocalVariable(name: "key", scope: !490, file: !3, line: 268, type: !493)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 152, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 19)
!496 = !DILocalVariable(name: "key_len", scope: !490, file: !3, line: 269, type: !28)
!497 = !DILocalVariable(name: "iter", scope: !498, file: !3, line: 306, type: !18)
!498 = distinct !DILexicalBlock(scope: !480, file: !3, line: 305, column: 27)
!499 = !DILocalVariable(name: "separator", scope: !498, file: !3, line: 307, type: !177)
!500 = !DILocalVariable(name: "separator_length", scope: !498, file: !3, line: 308, type: !46)
!501 = !DILocalVariable(name: "loop_key", scope: !498, file: !3, line: 309, type: !493)
!502 = !DILocalVariable(name: "loop_key_len", scope: !498, file: !3, line: 310, type: !28)
!503 = !DILocalVariable(name: "keys", scope: !504, file: !3, line: 337, type: !506)
!504 = distinct !DILexicalBlock(scope: !505, file: !3, line: 336, column: 41)
!505 = distinct !DILexicalBlock(scope: !498, file: !3, line: 336, column: 17)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "key_len", file: !3, line: 198, size: 128, elements: !508)
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !507, file: !3, line: 199, baseType: !177, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !507, file: !3, line: 200, baseType: !46, size: 32, offset: 64)
!511 = !DILocalVariable(name: "size", scope: !504, file: !3, line: 338, type: !28)
!512 = !DILocalVariable(name: "i", scope: !504, file: !3, line: 338, type: !28)
!513 = !DILocalVariable(name: "keylen", scope: !514, file: !3, line: 347, type: !506)
!514 = distinct !DILexicalBlock(scope: !504, file: !3, line: 346, column: 30)
!515 = !DILocalVariable(name: "key", scope: !516, file: !3, line: 360, type: !519)
!516 = distinct !DILexicalBlock(scope: !517, file: !3, line: 359, column: 44)
!517 = distinct !DILexicalBlock(scope: !518, file: !3, line: 359, column: 17)
!518 = distinct !DILexicalBlock(scope: !504, file: !3, line: 359, column: 17)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !507)
!521 = !DILocalVariable(name: "value", scope: !516, file: !3, line: 361, type: !100)
!522 = !DILocalVariable(name: "next", scope: !523, file: !3, line: 393, type: !18)
!523 = distinct !DILexicalBlock(scope: !524, file: !3, line: 392, column: 30)
!524 = distinct !DILexicalBlock(scope: !505, file: !3, line: 389, column: 20)
!525 = !DILocalVariable(name: "key", scope: !523, file: !3, line: 394, type: !177)
!526 = !DILocalVariable(name: "key_len", scope: !523, file: !3, line: 395, type: !36)
!527 = !DILocation(line: 0, scope: !466)
!528 = !DILocation(line: 217, column: 17, scope: !466)
!529 = !DILocation(line: 219, column: 11, scope: !466)
!530 = !DILocation(line: 221, column: 10, scope: !531)
!531 = distinct !DILexicalBlock(scope: !466, file: !3, line: 221, column: 9)
!532 = !DILocation(line: 221, column: 9, scope: !466)
!533 = !DILocation(line: 224, column: 13, scope: !466)
!534 = !DILocation(line: 224, column: 5, scope: !466)
!535 = !DILocation(line: 226, column: 20, scope: !480)
!536 = !DILocation(line: 226, column: 13, scope: !480)
!537 = !DILocation(line: 229, column: 20, scope: !480)
!538 = !DILocation(line: 229, column: 13, scope: !480)
!539 = !DILocation(line: 232, column: 20, scope: !480)
!540 = !DILocation(line: 232, column: 13, scope: !480)
!541 = !DILocation(line: 235, column: 13, scope: !479)
!542 = !DILocation(line: 235, column: 18, scope: !479)
!543 = !DILocation(line: 239, column: 29, scope: !479)
!544 = !DILocation(line: 238, column: 20, scope: !479)
!545 = !DILocation(line: 0, scope: !479)
!546 = !DILocation(line: 240, column: 26, scope: !547)
!547 = distinct !DILexicalBlock(scope: !479, file: !3, line: 240, column: 17)
!548 = !DILocation(line: 243, column: 33, scope: !479)
!549 = !DILocation(line: 243, column: 20, scope: !479)
!550 = !DILocation(line: 243, column: 13, scope: !479)
!551 = !DILocation(line: 244, column: 9, scope: !480)
!552 = !DILocation(line: 247, column: 13, scope: !486)
!553 = !DILocation(line: 247, column: 18, scope: !486)
!554 = !DILocation(line: 249, column: 28, scope: !486)
!555 = !DILocation(line: 0, scope: !486)
!556 = !DILocation(line: 252, column: 33, scope: !486)
!557 = !DILocation(line: 251, column: 20, scope: !486)
!558 = !DILocation(line: 253, column: 22, scope: !559)
!559 = distinct !DILexicalBlock(scope: !486, file: !3, line: 253, column: 17)
!560 = !DILocation(line: 253, column: 17, scope: !486)
!561 = !DILocation(line: 256, column: 33, scope: !486)
!562 = !DILocation(line: 256, column: 20, scope: !486)
!563 = !DILocation(line: 256, column: 13, scope: !486)
!564 = !DILocation(line: 257, column: 9, scope: !480)
!565 = !DILocation(line: 260, column: 32, scope: !480)
!566 = !DILocation(line: 260, column: 57, scope: !480)
!567 = !DILocation(line: 260, column: 20, scope: !480)
!568 = !DILocation(line: 260, column: 13, scope: !480)
!569 = !DILocation(line: 268, column: 13, scope: !490)
!570 = !DILocation(line: 268, column: 18, scope: !490)
!571 = !DILocation(line: 269, column: 13, scope: !490)
!572 = !DILocation(line: 0, scope: !490)
!573 = !DILocation(line: 272, column: 17, scope: !574)
!574 = distinct !DILexicalBlock(scope: !490, file: !3, line: 272, column: 17)
!575 = !DILocation(line: 272, column: 17, scope: !490)
!576 = !DILocation(line: 275, column: 17, scope: !490)
!577 = !DILocation(line: 277, column: 18, scope: !578)
!578 = distinct !DILexicalBlock(scope: !490, file: !3, line: 277, column: 17)
!579 = !DILocation(line: 277, column: 24, scope: !578)
!580 = !DILocation(line: 277, column: 27, scope: !578)
!581 = !DILocation(line: 277, column: 17, scope: !490)
!582 = !DILocation(line: 279, column: 19, scope: !583)
!583 = distinct !DILexicalBlock(scope: !490, file: !3, line: 279, column: 17)
!584 = !DILocation(line: 279, column: 17, scope: !490)
!585 = !DILocation(line: 280, column: 45, scope: !586)
!586 = distinct !DILexicalBlock(scope: !583, file: !3, line: 279, column: 25)
!587 = !{!441, !441, i64 0}
!588 = !DILocation(line: 280, column: 17, scope: !586)
!589 = !DILocation(line: 281, column: 24, scope: !586)
!590 = !DILocation(line: 281, column: 36, scope: !586)
!591 = !DILocation(line: 283, column: 42, scope: !592)
!592 = distinct !DILexicalBlock(scope: !490, file: !3, line: 283, column: 17)
!593 = !DILocation(line: 283, column: 17, scope: !592)
!594 = !DILocation(line: 283, column: 17, scope: !490)
!595 = !DILocation(line: 286, column: 13, scope: !596)
!596 = distinct !DILexicalBlock(scope: !490, file: !3, line: 286, column: 13)
!597 = !DILocation(line: 287, column: 29, scope: !598)
!598 = distinct !DILexicalBlock(scope: !599, file: !3, line: 287, column: 21)
!599 = distinct !DILexicalBlock(scope: !600, file: !3, line: 286, column: 37)
!600 = distinct !DILexicalBlock(scope: !596, file: !3, line: 286, column: 13)
!601 = !DILocation(line: 287, column: 21, scope: !598)
!602 = !DILocation(line: 287, column: 21, scope: !599)
!603 = !DILocation(line: 291, column: 23, scope: !604)
!604 = distinct !DILexicalBlock(scope: !599, file: !3, line: 291, column: 21)
!605 = !DILocation(line: 291, column: 21, scope: !599)
!606 = !DILocation(line: 292, column: 25, scope: !607)
!607 = distinct !DILexicalBlock(scope: !608, file: !3, line: 292, column: 25)
!608 = distinct !DILexicalBlock(scope: !604, file: !3, line: 291, column: 32)
!609 = !DILocation(line: 292, column: 44, scope: !607)
!610 = !DILocation(line: 293, column: 25, scope: !607)
!611 = !DILocation(line: 292, column: 25, scope: !608)
!612 = !DILocation(line: 296, column: 25, scope: !613)
!613 = distinct !DILexicalBlock(scope: !614, file: !3, line: 296, column: 25)
!614 = distinct !DILexicalBlock(scope: !604, file: !3, line: 295, column: 24)
!615 = !DILocation(line: 296, column: 25, scope: !614)
!616 = !DILocation(line: 286, column: 32, scope: !600)
!617 = !DILocation(line: 286, column: 27, scope: !600)
!618 = distinct !{!618, !595, !619, !620}
!619 = !DILocation(line: 299, column: 13, scope: !596)
!620 = !{!"llvm.loop.mustprogress"}
!621 = !DILocation(line: 301, column: 41, scope: !490)
!622 = !DILocation(line: 301, column: 13, scope: !490)
!623 = !DILocation(line: 302, column: 20, scope: !490)
!624 = !DILocation(line: 302, column: 32, scope: !490)
!625 = !DILocation(line: 303, column: 9, scope: !480)
!626 = !DILocation(line: 309, column: 13, scope: !498)
!627 = !DILocation(line: 309, column: 18, scope: !498)
!628 = !DILocation(line: 310, column: 13, scope: !498)
!629 = !DILocation(line: 312, column: 23, scope: !630)
!630 = distinct !DILexicalBlock(scope: !498, file: !3, line: 312, column: 17)
!631 = !DILocation(line: 0, scope: !498)
!632 = !DILocation(line: 321, column: 17, scope: !633)
!633 = distinct !DILexicalBlock(scope: !498, file: !3, line: 321, column: 17)
!634 = !DILocation(line: 321, column: 17, scope: !498)
!635 = !DILocation(line: 325, column: 20, scope: !498)
!636 = !DILocation(line: 327, column: 18, scope: !637)
!637 = distinct !DILexicalBlock(scope: !498, file: !3, line: 327, column: 17)
!638 = !DILocation(line: 327, column: 24, scope: !637)
!639 = !DILocation(line: 327, column: 27, scope: !637)
!640 = !DILocation(line: 327, column: 17, scope: !498)
!641 = !DILocation(line: 329, column: 18, scope: !642)
!642 = distinct !DILexicalBlock(scope: !498, file: !3, line: 329, column: 17)
!643 = !DILocation(line: 329, column: 17, scope: !498)
!644 = !DILocation(line: 330, column: 50, scope: !645)
!645 = distinct !DILexicalBlock(scope: !642, file: !3, line: 329, column: 24)
!646 = !DILocation(line: 330, column: 17, scope: !645)
!647 = !DILocation(line: 331, column: 24, scope: !645)
!648 = !DILocation(line: 331, column: 36, scope: !645)
!649 = !DILocation(line: 333, column: 42, scope: !650)
!650 = distinct !DILexicalBlock(scope: !498, file: !3, line: 333, column: 17)
!651 = !DILocation(line: 333, column: 17, scope: !650)
!652 = !DILocation(line: 333, column: 17, scope: !498)
!653 = !DILocation(line: 336, column: 23, scope: !505)
!654 = !DILocation(line: 336, column: 17, scope: !498)
!655 = !DILocation(line: 340, column: 24, scope: !504)
!656 = !DILocation(line: 0, scope: !504)
!657 = !DILocation(line: 341, column: 42, scope: !504)
!658 = !DILocation(line: 341, column: 24, scope: !504)
!659 = !DILocation(line: 342, column: 22, scope: !660)
!660 = distinct !DILexicalBlock(scope: !504, file: !3, line: 342, column: 21)
!661 = !DILocation(line: 342, column: 21, scope: !504)
!662 = !DILocation(line: 0, scope: !514)
!663 = !DILocation(line: 349, column: 35, scope: !514)
!664 = !DILocation(line: 349, column: 29, scope: !514)
!665 = !DILocation(line: 349, column: 33, scope: !514)
!666 = !{!667, !668, i64 0}
!667 = !{!"key_len", !668, i64 0, !669, i64 8}
!668 = !{!"any pointer", !439, i64 0}
!669 = !{!"int", !439, i64 0}
!670 = !DILocation(line: 350, column: 35, scope: !514)
!671 = !DILocation(line: 350, column: 29, scope: !514)
!672 = !DILocation(line: 350, column: 33, scope: !514)
!673 = !{!667, !669, i64 8}
!674 = !DILocation(line: 352, column: 28, scope: !514)
!675 = !DILocation(line: 353, column: 22, scope: !514)
!676 = !DILocation(line: 346, column: 17, scope: !504)
!677 = distinct !{!677, !676, !678, !620}
!678 = !DILocation(line: 354, column: 17, scope: !504)
!679 = !DILocation(line: 355, column: 17, scope: !680)
!680 = distinct !DILexicalBlock(scope: !681, file: !3, line: 355, column: 17)
!681 = distinct !DILexicalBlock(scope: !504, file: !3, line: 355, column: 17)
!682 = !DILocation(line: 355, column: 17, scope: !681)
!683 = !DILocation(line: 357, column: 17, scope: !504)
!684 = !DILocation(line: 359, column: 31, scope: !517)
!685 = !DILocation(line: 359, column: 17, scope: !518)
!686 = !DILocation(line: 0, scope: !516)
!687 = !DILocation(line: 364, column: 57, scope: !516)
!688 = !DILocation(line: 364, column: 67, scope: !516)
!689 = !DILocation(line: 364, column: 62, scope: !516)
!690 = !DILocation(line: 364, column: 29, scope: !516)
!691 = !DILocation(line: 365, column: 21, scope: !692)
!692 = distinct !DILexicalBlock(scope: !693, file: !3, line: 365, column: 21)
!693 = distinct !DILexicalBlock(scope: !516, file: !3, line: 365, column: 21)
!694 = !DILocation(line: 365, column: 21, scope: !693)
!695 = !DILocation(line: 367, column: 38, scope: !516)
!696 = !DILocation(line: 367, column: 48, scope: !516)
!697 = !DILocation(line: 367, column: 43, scope: !516)
!698 = !DILocation(line: 367, column: 21, scope: !516)
!699 = !DILocation(line: 368, column: 25, scope: !700)
!700 = distinct !DILexicalBlock(scope: !516, file: !3, line: 368, column: 25)
!701 = !DILocation(line: 368, column: 65, scope: !700)
!702 = !DILocation(line: 369, column: 25, scope: !700)
!703 = !DILocation(line: 368, column: 25, scope: !516)
!704 = !DILocation(line: 370, column: 25, scope: !705)
!705 = distinct !DILexicalBlock(scope: !700, file: !3, line: 369, column: 80)
!706 = !DILocation(line: 374, column: 27, scope: !707)
!707 = distinct !DILexicalBlock(scope: !516, file: !3, line: 374, column: 25)
!708 = !DILocation(line: 374, column: 25, scope: !516)
!709 = !DILocation(line: 375, column: 29, scope: !710)
!710 = distinct !DILexicalBlock(scope: !711, file: !3, line: 375, column: 29)
!711 = distinct !DILexicalBlock(scope: !707, file: !3, line: 374, column: 39)
!712 = !DILocation(line: 375, column: 48, scope: !710)
!713 = !DILocation(line: 376, column: 29, scope: !710)
!714 = !DILocation(line: 375, column: 29, scope: !711)
!715 = !DILocation(line: 377, column: 29, scope: !716)
!716 = distinct !DILexicalBlock(scope: !710, file: !3, line: 376, column: 75)
!717 = !DILocation(line: 381, column: 29, scope: !718)
!718 = distinct !DILexicalBlock(scope: !719, file: !3, line: 381, column: 29)
!719 = distinct !DILexicalBlock(scope: !707, file: !3, line: 380, column: 28)
!720 = !DILocation(line: 381, column: 29, scope: !719)
!721 = !DILocation(line: 382, column: 29, scope: !722)
!722 = distinct !DILexicalBlock(scope: !718, file: !3, line: 381, column: 71)
!723 = !DILocation(line: 359, column: 40, scope: !517)
!724 = distinct !{!724, !685, !725, !620}
!725 = !DILocation(line: 386, column: 17, scope: !518)
!726 = !DILocation(line: 388, column: 17, scope: !504)
!727 = !DILocation(line: 393, column: 34, scope: !523)
!728 = !DILocation(line: 0, scope: !523)
!729 = !DILocation(line: 394, column: 39, scope: !523)
!730 = !DILocation(line: 395, column: 44, scope: !523)
!731 = !DILocation(line: 397, column: 21, scope: !523)
!732 = !DILocation(line: 398, column: 25, scope: !733)
!733 = distinct !DILexicalBlock(scope: !523, file: !3, line: 398, column: 25)
!734 = !DILocation(line: 398, column: 65, scope: !733)
!735 = !DILocation(line: 399, column: 33, scope: !733)
!736 = !DILocation(line: 399, column: 25, scope: !733)
!737 = !DILocation(line: 398, column: 25, scope: !523)
!738 = !DILocation(line: 403, column: 25, scope: !739)
!739 = distinct !DILexicalBlock(scope: !523, file: !3, line: 403, column: 25)
!740 = !DILocation(line: 403, column: 25, scope: !523)
!741 = !DILocation(line: 404, column: 29, scope: !742)
!742 = distinct !DILexicalBlock(scope: !743, file: !3, line: 404, column: 29)
!743 = distinct !DILexicalBlock(scope: !739, file: !3, line: 403, column: 31)
!744 = !DILocation(line: 404, column: 48, scope: !742)
!745 = !DILocation(line: 405, column: 29, scope: !742)
!746 = !DILocation(line: 404, column: 29, scope: !743)
!747 = !DILocation(line: 408, column: 29, scope: !748)
!748 = distinct !DILexicalBlock(scope: !749, file: !3, line: 408, column: 29)
!749 = distinct !DILexicalBlock(scope: !739, file: !3, line: 407, column: 28)
!750 = !DILocation(line: 408, column: 29, scope: !749)
!751 = !DILocation(line: 416, column: 46, scope: !498)
!752 = !DILocation(line: 416, column: 13, scope: !498)
!753 = !DILocation(line: 417, column: 20, scope: !498)
!754 = !DILocation(line: 417, column: 32, scope: !498)
!755 = !DILocation(line: 418, column: 9, scope: !480)
!756 = !DILocation(line: 424, column: 1, scope: !466)
!757 = distinct !DISubprogram(name: "dump_string", scope: !3, file: !3, line: 94, type: !758, scopeLine: 95, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !760)
!758 = !DISubroutineType(types: !759)
!759 = !{!46, !177, !28, !398, !18, !28}
!760 = !{!761, !762, !763, !764, !765, !766, !767, !768, !769, !773, !775, !779, !780, !785}
!761 = !DILocalVariable(name: "str", arg: 1, scope: !757, file: !3, line: 94, type: !177)
!762 = !DILocalVariable(name: "len", arg: 2, scope: !757, file: !3, line: 94, type: !28)
!763 = !DILocalVariable(name: "dump", arg: 3, scope: !757, file: !3, line: 94, type: !398)
!764 = !DILocalVariable(name: "data", arg: 4, scope: !757, file: !3, line: 94, type: !18)
!765 = !DILocalVariable(name: "flags", arg: 5, scope: !757, file: !3, line: 95, type: !28)
!766 = !DILocalVariable(name: "pos", scope: !757, file: !3, line: 96, type: !177)
!767 = !DILocalVariable(name: "end", scope: !757, file: !3, line: 96, type: !177)
!768 = !DILocalVariable(name: "lim", scope: !757, file: !3, line: 96, type: !177)
!769 = !DILocalVariable(name: "codepoint", scope: !757, file: !3, line: 97, type: !770)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !771, line: 26, baseType: !772)
!771 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !67, line: 41, baseType: !46)
!773 = !DILocalVariable(name: "text", scope: !774, file: !3, line: 105, type: !177)
!774 = distinct !DILexicalBlock(scope: !757, file: !3, line: 104, column: 15)
!775 = !DILocalVariable(name: "seq", scope: !774, file: !3, line: 106, type: !776)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 104, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 13)
!779 = !DILocalVariable(name: "length", scope: !774, file: !3, line: 107, type: !46)
!780 = !DILocalVariable(name: "first", scope: !781, file: !3, line: 173, type: !770)
!781 = distinct !DILexicalBlock(scope: !782, file: !3, line: 172, column: 22)
!782 = distinct !DILexicalBlock(scope: !783, file: !3, line: 166, column: 21)
!783 = distinct !DILexicalBlock(scope: !784, file: !3, line: 164, column: 22)
!784 = distinct !DILexicalBlock(scope: !774, file: !3, line: 139, column: 28)
!785 = !DILocalVariable(name: "last", scope: !781, file: !3, line: 173, type: !770)
!786 = !DILocation(line: 0, scope: !757)
!787 = !DILocation(line: 97, column: 5, scope: !757)
!788 = !DILocation(line: 97, column: 13, scope: !757)
!789 = !{!669, !669, i64 0}
!790 = !DILocation(line: 99, column: 9, scope: !791)
!791 = distinct !DILexicalBlock(scope: !757, file: !3, line: 99, column: 9)
!792 = !DILocation(line: 99, column: 9, scope: !757)
!793 = !DILocation(line: 103, column: 15, scope: !757)
!794 = !DILocation(line: 104, column: 5, scope: !757)
!795 = !DILocation(line: 106, column: 9, scope: !774)
!796 = !DILocation(line: 106, column: 14, scope: !774)
!797 = !DILocation(line: 109, column: 9, scope: !774)
!798 = !DILocation(line: 109, column: 20, scope: !774)
!799 = !DILocation(line: 110, column: 41, scope: !800)
!800 = distinct !DILexicalBlock(scope: !774, file: !3, line: 109, column: 27)
!801 = !DILocation(line: 110, column: 19, scope: !800)
!802 = !DILocation(line: 111, column: 18, scope: !803)
!803 = distinct !DILexicalBlock(scope: !800, file: !3, line: 111, column: 17)
!804 = !DILocation(line: 111, column: 17, scope: !800)
!805 = !DILocation(line: 115, column: 17, scope: !806)
!806 = distinct !DILexicalBlock(scope: !800, file: !3, line: 115, column: 17)
!807 = !DILocation(line: 115, column: 35, scope: !806)
!808 = !DILocation(line: 119, column: 45, scope: !809)
!809 = distinct !DILexicalBlock(scope: !800, file: !3, line: 119, column: 17)
!810 = distinct !{!810, !797, !811, !620}
!811 = !DILocation(line: 127, column: 9, scope: !774)
!812 = !DILocation(line: 129, column: 17, scope: !813)
!813 = distinct !DILexicalBlock(scope: !774, file: !3, line: 129, column: 13)
!814 = !DILocation(line: 129, column: 13, scope: !774)
!815 = !DILocation(line: 130, column: 31, scope: !816)
!816 = distinct !DILexicalBlock(scope: !817, file: !3, line: 130, column: 17)
!817 = distinct !DILexicalBlock(scope: !813, file: !3, line: 129, column: 25)
!818 = !DILocation(line: 130, column: 17, scope: !816)
!819 = !DILocation(line: 130, column: 17, scope: !817)
!820 = !DILocation(line: 134, column: 17, scope: !821)
!821 = distinct !DILexicalBlock(scope: !774, file: !3, line: 134, column: 13)
!822 = !DILocation(line: 134, column: 13, scope: !774)
!823 = !DILocation(line: 0, scope: !774)
!824 = !DILocation(line: 139, column: 17, scope: !774)
!825 = !DILocation(line: 139, column: 9, scope: !774)
!826 = !DILocation(line: 145, column: 17, scope: !784)
!827 = !DILocation(line: 148, column: 17, scope: !784)
!828 = !DILocation(line: 151, column: 17, scope: !784)
!829 = !DILocation(line: 154, column: 17, scope: !784)
!830 = !DILocation(line: 157, column: 17, scope: !784)
!831 = !DILocation(line: 160, column: 17, scope: !784)
!832 = !DILocation(line: 163, column: 17, scope: !784)
!833 = !DILocation(line: 166, column: 31, scope: !782)
!834 = !DILocation(line: 166, column: 21, scope: !783)
!835 = !DILocation(line: 167, column: 21, scope: !836)
!836 = distinct !DILexicalBlock(scope: !782, file: !3, line: 166, column: 42)
!837 = !DILocation(line: 169, column: 17, scope: !836)
!838 = !DILocation(line: 175, column: 31, scope: !781)
!839 = !DILocation(line: 176, column: 61, scope: !781)
!840 = !DILocation(line: 176, column: 36, scope: !781)
!841 = !DILocation(line: 0, scope: !781)
!842 = !DILocation(line: 177, column: 48, scope: !781)
!843 = !DILocation(line: 177, column: 35, scope: !781)
!844 = !DILocation(line: 179, column: 21, scope: !781)
!845 = !DILocation(line: 0, scope: !784)
!846 = !DILocation(line: 189, column: 13, scope: !847)
!847 = distinct !DILexicalBlock(scope: !774, file: !3, line: 189, column: 13)
!848 = !DILocation(line: 193, column: 5, scope: !757)
!849 = !DILocation(line: 195, column: 12, scope: !757)
!850 = !DILocation(line: 195, column: 5, scope: !757)
!851 = !DILocation(line: 196, column: 1, scope: !757)
!852 = distinct !DISubprogram(name: "dump_indent", scope: !3, file: !3, line: 71, type: !853, scopeLine: 72, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !855)
!853 = !DISubroutineType(types: !854)
!854 = !{!46, !28, !46, !46, !398, !18}
!855 = !{!856, !857, !858, !859, !860, !861, !864, !865}
!856 = !DILocalVariable(name: "flags", arg: 1, scope: !852, file: !3, line: 71, type: !28)
!857 = !DILocalVariable(name: "depth", arg: 2, scope: !852, file: !3, line: 71, type: !46)
!858 = !DILocalVariable(name: "space", arg: 3, scope: !852, file: !3, line: 71, type: !46)
!859 = !DILocalVariable(name: "dump", arg: 4, scope: !852, file: !3, line: 71, type: !398)
!860 = !DILocalVariable(name: "data", arg: 5, scope: !852, file: !3, line: 72, type: !18)
!861 = !DILocalVariable(name: "ws_count", scope: !862, file: !3, line: 74, type: !7)
!862 = distinct !DILexicalBlock(scope: !863, file: !3, line: 73, column: 37)
!863 = distinct !DILexicalBlock(scope: !852, file: !3, line: 73, column: 9)
!864 = !DILocalVariable(name: "n_spaces", scope: !862, file: !3, line: 74, type: !7)
!865 = !DILocalVariable(name: "cur_n", scope: !866, file: !3, line: 80, type: !46)
!866 = distinct !DILexicalBlock(scope: !862, file: !3, line: 79, column: 30)
!867 = !DILocation(line: 0, scope: !852)
!868 = !DILocation(line: 73, column: 9, scope: !863)
!869 = !DILocation(line: 73, column: 32, scope: !863)
!870 = !DILocation(line: 73, column: 9, scope: !852)
!871 = !DILocation(line: 0, scope: !862)
!872 = !DILocation(line: 76, column: 13, scope: !873)
!873 = distinct !DILexicalBlock(scope: !862, file: !3, line: 76, column: 13)
!874 = !DILocation(line: 76, column: 13, scope: !862)
!875 = !DILocation(line: 74, column: 33, scope: !862)
!876 = !DILocation(line: 74, column: 74, scope: !862)
!877 = !DILocation(line: 79, column: 9, scope: !862)
!878 = !DILocation(line: 74, column: 57, scope: !862)
!879 = !DILocation(line: 79, column: 25, scope: !862)
!880 = !DILocation(line: 81, column: 26, scope: !866)
!881 = !DILocation(line: 81, column: 17, scope: !866)
!882 = !DILocation(line: 0, scope: !866)
!883 = !DILocation(line: 83, column: 34, scope: !884)
!884 = distinct !DILexicalBlock(scope: !866, file: !3, line: 83, column: 17)
!885 = !DILocation(line: 83, column: 17, scope: !884)
!886 = !DILocation(line: 83, column: 17, scope: !866)
!887 = distinct !{!887, !877, !888, !620}
!888 = !DILocation(line: 87, column: 9, scope: !862)
!889 = !DILocation(line: 88, column: 16, scope: !890)
!890 = distinct !DILexicalBlock(scope: !863, file: !3, line: 88, column: 16)
!891 = !DILocation(line: 88, column: 22, scope: !890)
!892 = !DILocation(line: 89, column: 16, scope: !893)
!893 = distinct !DILexicalBlock(scope: !890, file: !3, line: 88, column: 50)
!894 = !DILocation(line: 89, column: 9, scope: !893)
!895 = !DILocation(line: 92, column: 1, scope: !852)
!896 = distinct !DISubprogram(name: "compare_keys", scope: !3, file: !3, line: 203, type: !897, scopeLine: 203, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !901)
!897 = !DISubroutineType(types: !898)
!898 = !{!46, !899, !899}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!901 = !{!902, !903, !904, !905, !906, !907}
!902 = !DILocalVariable(name: "key1", arg: 1, scope: !896, file: !3, line: 203, type: !899)
!903 = !DILocalVariable(name: "key2", arg: 2, scope: !896, file: !3, line: 203, type: !899)
!904 = !DILocalVariable(name: "k1", scope: !896, file: !3, line: 204, type: !519)
!905 = !DILocalVariable(name: "k2", scope: !896, file: !3, line: 205, type: !519)
!906 = !DILocalVariable(name: "min_size", scope: !896, file: !3, line: 206, type: !36)
!907 = !DILocalVariable(name: "res", scope: !896, file: !3, line: 207, type: !46)
!908 = !DILocation(line: 0, scope: !896)
!909 = !DILocation(line: 206, column: 33, scope: !896)
!910 = !DILocation(line: 206, column: 43, scope: !896)
!911 = !DILocation(line: 206, column: 37, scope: !896)
!912 = !DILocation(line: 206, column: 29, scope: !896)
!913 = !DILocation(line: 207, column: 26, scope: !896)
!914 = !DILocation(line: 207, column: 35, scope: !896)
!915 = !DILocation(line: 207, column: 15, scope: !896)
!916 = !DILocation(line: 209, column: 9, scope: !917)
!917 = distinct !DILexicalBlock(scope: !896, file: !3, line: 209, column: 9)
!918 = !DILocation(line: 209, column: 9, scope: !896)
!919 = !DILocation(line: 213, column: 1, scope: !896)
!920 = !DISubprogram(name: "qsort", scope: !921, file: !921, line: 838, type: !922, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !264)
!921 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!922 = !DISubroutineType(types: !923)
!923 = !{null, !18, !28, !28, !924}
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !921, line: 816, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!926 = !DILocation(line: 0, scope: !395)
!927 = !DILocation(line: 477, column: 5, scope: !395)
!928 = !DILocation(line: 477, column: 17, scope: !395)
!929 = !DILocation(line: 479, column: 17, scope: !432)
!930 = !DILocation(line: 479, column: 9, scope: !395)
!931 = !DILocation(line: 480, column: 14, scope: !435)
!932 = !DILocation(line: 480, column: 34, scope: !435)
!933 = !DILocation(line: 484, column: 9, scope: !444)
!934 = !DILocation(line: 484, column: 9, scope: !395)
!935 = !DILocation(line: 486, column: 11, scope: !395)
!936 = !DILocation(line: 487, column: 5, scope: !395)
!937 = !DILocation(line: 489, column: 5, scope: !395)
!938 = !DILocation(line: 490, column: 1, scope: !395)
!939 = distinct !DISubprogram(name: "json_dumpb", scope: !3, file: !3, line: 442, type: !940, scopeLine: 442, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !942)
!940 = !DISubroutineType(types: !941)
!941 = !{!28, !381, !25, !28, !28}
!942 = !{!943, !944, !945, !946, !947}
!943 = !DILocalVariable(name: "json", arg: 1, scope: !939, file: !3, line: 442, type: !381)
!944 = !DILocalVariable(name: "buffer", arg: 2, scope: !939, file: !3, line: 442, type: !25)
!945 = !DILocalVariable(name: "size", arg: 3, scope: !939, file: !3, line: 442, type: !28)
!946 = !DILocalVariable(name: "flags", arg: 4, scope: !939, file: !3, line: 442, type: !28)
!947 = !DILocalVariable(name: "buf", scope: !939, file: !3, line: 443, type: !33)
!948 = !DILocation(line: 0, scope: !939)
!949 = !DILocation(line: 443, column: 5, scope: !939)
!950 = !DILocation(line: 443, column: 19, scope: !939)
!951 = !DILocation(line: 443, column: 25, scope: !939)
!952 = !{!953, !441, i64 0}
!953 = !{!"buffer", !441, i64 0, !441, i64 8, !668, i64 16}
!954 = !{!953, !441, i64 8}
!955 = !{!953, !668, i64 16}
!956 = !DILocation(line: 0, scope: !395, inlinedAt: !957)
!957 = distinct !DILocation(line: 445, column: 9, scope: !958)
!958 = distinct !DILexicalBlock(scope: !939, file: !3, line: 445, column: 9)
!959 = !DILocation(line: 477, column: 5, scope: !395, inlinedAt: !957)
!960 = !DILocation(line: 477, column: 17, scope: !395, inlinedAt: !957)
!961 = !DILocation(line: 479, column: 17, scope: !432, inlinedAt: !957)
!962 = !DILocation(line: 479, column: 9, scope: !395, inlinedAt: !957)
!963 = !DILocation(line: 480, column: 14, scope: !435, inlinedAt: !957)
!964 = !DILocation(line: 480, column: 34, scope: !435, inlinedAt: !957)
!965 = !DILocation(line: 484, column: 9, scope: !444, inlinedAt: !957)
!966 = !DILocation(line: 484, column: 9, scope: !395, inlinedAt: !957)
!967 = !DILocation(line: 490, column: 1, scope: !395, inlinedAt: !957)
!968 = !DILocation(line: 445, column: 9, scope: !939)
!969 = !DILocation(line: 486, column: 11, scope: !395, inlinedAt: !957)
!970 = !DILocation(line: 487, column: 5, scope: !395, inlinedAt: !957)
!971 = !DILocation(line: 445, column: 9, scope: !958)
!972 = !DILocation(line: 449, column: 1, scope: !939)
!973 = distinct !DISubprogram(name: "dump_to_buffer", scope: !3, file: !3, line: 42, type: !400, scopeLine: 42, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !974)
!974 = !{!975, !976, !977, !978}
!975 = !DILocalVariable(name: "buffer", arg: 1, scope: !973, file: !3, line: 42, type: !177)
!976 = !DILocalVariable(name: "size", arg: 2, scope: !973, file: !3, line: 42, type: !28)
!977 = !DILocalVariable(name: "data", arg: 3, scope: !973, file: !3, line: 42, type: !18)
!978 = !DILocalVariable(name: "buf", scope: !973, file: !3, line: 43, type: !32)
!979 = !DILocation(line: 0, scope: !973)
!980 = !DILocation(line: 45, column: 14, scope: !981)
!981 = distinct !DILexicalBlock(scope: !973, file: !3, line: 45, column: 9)
!982 = !DILocation(line: 45, column: 19, scope: !981)
!983 = !DILocation(line: 45, column: 34, scope: !981)
!984 = !DILocation(line: 45, column: 26, scope: !981)
!985 = !DILocation(line: 45, column: 9, scope: !973)
!986 = !DILocation(line: 46, column: 22, scope: !981)
!987 = !DILocation(line: 46, column: 17, scope: !981)
!988 = !DILocation(line: 46, column: 9, scope: !981)
!989 = !DILocation(line: 48, column: 15, scope: !973)
!990 = !DILocation(line: 49, column: 5, scope: !973)
!991 = distinct !DISubprogram(name: "json_dumpf", scope: !3, file: !3, line: 451, type: !992, scopeLine: 451, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !994)
!992 = !DISubroutineType(types: !993)
!993 = !{!46, !381, !39, !28}
!994 = !{!995, !996, !997}
!995 = !DILocalVariable(name: "json", arg: 1, scope: !991, file: !3, line: 451, type: !381)
!996 = !DILocalVariable(name: "output", arg: 2, scope: !991, file: !3, line: 451, type: !39)
!997 = !DILocalVariable(name: "flags", arg: 3, scope: !991, file: !3, line: 451, type: !28)
!998 = !DILocation(line: 0, scope: !991)
!999 = !DILocation(line: 452, column: 51, scope: !991)
!1000 = !DILocation(line: 0, scope: !395, inlinedAt: !1001)
!1001 = distinct !DILocation(line: 452, column: 12, scope: !991)
!1002 = !DILocation(line: 477, column: 5, scope: !395, inlinedAt: !1001)
!1003 = !DILocation(line: 477, column: 17, scope: !395, inlinedAt: !1001)
!1004 = !DILocation(line: 479, column: 17, scope: !432, inlinedAt: !1001)
!1005 = !DILocation(line: 479, column: 9, scope: !395, inlinedAt: !1001)
!1006 = !DILocation(line: 480, column: 14, scope: !435, inlinedAt: !1001)
!1007 = !DILocation(line: 480, column: 34, scope: !435, inlinedAt: !1001)
!1008 = !DILocation(line: 484, column: 9, scope: !444, inlinedAt: !1001)
!1009 = !DILocation(line: 484, column: 9, scope: !395, inlinedAt: !1001)
!1010 = !DILocation(line: 486, column: 11, scope: !395, inlinedAt: !1001)
!1011 = !DILocation(line: 487, column: 5, scope: !395, inlinedAt: !1001)
!1012 = !DILocation(line: 489, column: 5, scope: !395, inlinedAt: !1001)
!1013 = !DILocation(line: 490, column: 1, scope: !395, inlinedAt: !1001)
!1014 = !DILocation(line: 452, column: 5, scope: !991)
!1015 = distinct !DISubprogram(name: "dump_to_file", scope: !3, file: !3, line: 52, type: !400, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1016)
!1016 = !{!1017, !1018, !1019, !1020}
!1017 = !DILocalVariable(name: "buffer", arg: 1, scope: !1015, file: !3, line: 52, type: !177)
!1018 = !DILocalVariable(name: "size", arg: 2, scope: !1015, file: !3, line: 52, type: !28)
!1019 = !DILocalVariable(name: "data", arg: 3, scope: !1015, file: !3, line: 52, type: !18)
!1020 = !DILocalVariable(name: "dest", scope: !1015, file: !3, line: 53, type: !39)
!1021 = !DILocation(line: 0, scope: !1015)
!1022 = !DILocation(line: 53, column: 18, scope: !1015)
!1023 = !DILocation(line: 54, column: 9, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 54, column: 9)
!1025 = !DILocation(line: 54, column: 39, scope: !1024)
!1026 = !DILocation(line: 57, column: 1, scope: !1015)
!1027 = distinct !DISubprogram(name: "json_dumpfd", scope: !3, file: !3, line: 455, type: !1028, scopeLine: 455, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1030)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!46, !381, !46, !28}
!1030 = !{!1031, !1032, !1033}
!1031 = !DILocalVariable(name: "json", arg: 1, scope: !1027, file: !3, line: 455, type: !381)
!1032 = !DILocalVariable(name: "output", arg: 2, scope: !1027, file: !3, line: 455, type: !46)
!1033 = !DILocalVariable(name: "flags", arg: 3, scope: !1027, file: !3, line: 455, type: !28)
!1034 = !DILocation(line: 0, scope: !1027)
!1035 = !DILocation(line: 456, column: 49, scope: !1027)
!1036 = !DILocation(line: 0, scope: !395, inlinedAt: !1037)
!1037 = distinct !DILocation(line: 456, column: 12, scope: !1027)
!1038 = !DILocation(line: 477, column: 5, scope: !395, inlinedAt: !1037)
!1039 = !DILocation(line: 477, column: 17, scope: !395, inlinedAt: !1037)
!1040 = !DILocation(line: 479, column: 17, scope: !432, inlinedAt: !1037)
!1041 = !DILocation(line: 479, column: 9, scope: !395, inlinedAt: !1037)
!1042 = !DILocation(line: 480, column: 14, scope: !435, inlinedAt: !1037)
!1043 = !DILocation(line: 480, column: 34, scope: !435, inlinedAt: !1037)
!1044 = !DILocation(line: 484, column: 9, scope: !444, inlinedAt: !1037)
!1045 = !DILocation(line: 484, column: 9, scope: !395, inlinedAt: !1037)
!1046 = !DILocation(line: 486, column: 11, scope: !395, inlinedAt: !1037)
!1047 = !DILocation(line: 487, column: 5, scope: !395, inlinedAt: !1037)
!1048 = !DILocation(line: 489, column: 5, scope: !395, inlinedAt: !1037)
!1049 = !DILocation(line: 490, column: 1, scope: !395, inlinedAt: !1037)
!1050 = !DILocation(line: 456, column: 5, scope: !1027)
!1051 = distinct !DISubprogram(name: "dump_to_fd", scope: !3, file: !3, line: 59, type: !400, scopeLine: 59, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1052)
!1052 = !{!1053, !1054, !1055, !1056}
!1053 = !DILocalVariable(name: "buffer", arg: 1, scope: !1051, file: !3, line: 59, type: !177)
!1054 = !DILocalVariable(name: "size", arg: 2, scope: !1051, file: !3, line: 59, type: !28)
!1055 = !DILocalVariable(name: "data", arg: 3, scope: !1051, file: !3, line: 59, type: !18)
!1056 = !DILocalVariable(name: "dest", scope: !1051, file: !3, line: 61, type: !96)
!1057 = !DILocation(line: 0, scope: !1051)
!1058 = !DILocation(line: 61, column: 17, scope: !1051)
!1059 = !DILocation(line: 62, column: 15, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 62, column: 9)
!1061 = !DILocation(line: 62, column: 9, scope: !1060)
!1062 = !DILocation(line: 62, column: 36, scope: !1060)
!1063 = !DILocation(line: 66, column: 1, scope: !1051)
!1064 = !DISubprogram(name: "write", scope: !1065, file: !1065, line: 378, type: !1066, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !264)
!1065 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!97, !46, !899, !28}
!1068 = distinct !DISubprogram(name: "json_dump_file", scope: !3, file: !3, line: 459, type: !1069, scopeLine: 459, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1071)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!46, !381, !177, !28}
!1071 = !{!1072, !1073, !1074, !1075, !1076}
!1072 = !DILocalVariable(name: "json", arg: 1, scope: !1068, file: !3, line: 459, type: !381)
!1073 = !DILocalVariable(name: "path", arg: 2, scope: !1068, file: !3, line: 459, type: !177)
!1074 = !DILocalVariable(name: "flags", arg: 3, scope: !1068, file: !3, line: 459, type: !28)
!1075 = !DILocalVariable(name: "result", scope: !1068, file: !3, line: 460, type: !46)
!1076 = !DILocalVariable(name: "output", scope: !1068, file: !3, line: 462, type: !39)
!1077 = !DILocation(line: 0, scope: !1068)
!1078 = !DILocation(line: 462, column: 20, scope: !1068)
!1079 = !DILocation(line: 463, column: 10, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1068, file: !3, line: 463, column: 9)
!1081 = !DILocation(line: 463, column: 9, scope: !1068)
!1082 = !DILocation(line: 0, scope: !991, inlinedAt: !1083)
!1083 = distinct !DILocation(line: 466, column: 14, scope: !1068)
!1084 = !DILocation(line: 452, column: 51, scope: !991, inlinedAt: !1083)
!1085 = !DILocation(line: 0, scope: !395, inlinedAt: !1086)
!1086 = distinct !DILocation(line: 452, column: 12, scope: !991, inlinedAt: !1083)
!1087 = !DILocation(line: 477, column: 5, scope: !395, inlinedAt: !1086)
!1088 = !DILocation(line: 477, column: 17, scope: !395, inlinedAt: !1086)
!1089 = !DILocation(line: 479, column: 17, scope: !432, inlinedAt: !1086)
!1090 = !DILocation(line: 479, column: 9, scope: !395, inlinedAt: !1086)
!1091 = !DILocation(line: 480, column: 14, scope: !435, inlinedAt: !1086)
!1092 = !DILocation(line: 480, column: 34, scope: !435, inlinedAt: !1086)
!1093 = !DILocation(line: 484, column: 9, scope: !444, inlinedAt: !1086)
!1094 = !DILocation(line: 484, column: 9, scope: !395, inlinedAt: !1086)
!1095 = !DILocation(line: 486, column: 11, scope: !395, inlinedAt: !1086)
!1096 = !DILocation(line: 487, column: 5, scope: !395, inlinedAt: !1086)
!1097 = !DILocation(line: 489, column: 5, scope: !395, inlinedAt: !1086)
!1098 = !DILocation(line: 490, column: 1, scope: !395, inlinedAt: !1086)
!1099 = !DILocation(line: 468, column: 9, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1068, file: !3, line: 468, column: 9)
!1101 = !DILocation(line: 468, column: 24, scope: !1100)
!1102 = !DILocation(line: 472, column: 1, scope: !1068)
!1103 = !DISubprogram(name: "fclose", scope: !98, file: !98, line: 178, type: !1104, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !264)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!46, !39}
!1106 = distinct !DISubprogram(name: "jsonp_error_init", scope: !269, file: !269, line: 4, type: !1107, scopeLine: 4, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !268, retainedNodes: !1124)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{null, !1109, !177}
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_error_t", file: !6, line: 158, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "json_error_t", file: !6, line: 152, size: 2016, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1116, !1120}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !1111, file: !6, line: 153, baseType: !46, size: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !1111, file: !6, line: 154, baseType: !46, size: 32, offset: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !1111, file: !6, line: 155, baseType: !46, size: 32, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1111, file: !6, line: 156, baseType: !1117, size: 640, offset: 96)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 640, elements: !1118)
!1118 = !{!1119}
!1119 = !DISubrange(count: 80)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1111, file: !6, line: 157, baseType: !1121, size: 1280, offset: 736)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 1280, elements: !1122)
!1122 = !{!1123}
!1123 = !DISubrange(count: 160)
!1124 = !{!1125, !1126}
!1125 = !DILocalVariable(name: "error", arg: 1, scope: !1106, file: !269, line: 4, type: !1109)
!1126 = !DILocalVariable(name: "source", arg: 2, scope: !1106, file: !269, line: 4, type: !177)
!1127 = !DILocation(line: 0, scope: !1106)
!1128 = !DILocation(line: 5, column: 9, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1106, file: !269, line: 5, column: 9)
!1130 = !DILocation(line: 5, column: 9, scope: !1106)
!1131 = !DILocation(line: 6, column: 9, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1129, file: !269, line: 5, column: 16)
!1133 = !DILocation(line: 6, column: 24, scope: !1132)
!1134 = !{!439, !439, i64 0}
!1135 = !DILocation(line: 7, column: 16, scope: !1132)
!1136 = !DILocation(line: 7, column: 21, scope: !1132)
!1137 = !{!1138, !669, i64 0}
!1138 = !{!"json_error_t", !669, i64 0, !669, i64 4, !669, i64 8, !439, i64 12, !439, i64 92}
!1139 = !DILocation(line: 8, column: 16, scope: !1132)
!1140 = !DILocation(line: 8, column: 23, scope: !1132)
!1141 = !{!1138, !669, i64 4}
!1142 = !DILocation(line: 9, column: 16, scope: !1132)
!1143 = !DILocation(line: 9, column: 25, scope: !1132)
!1144 = !{!1138, !669, i64 8}
!1145 = !DILocation(line: 10, column: 13, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1132, file: !269, line: 10, column: 13)
!1147 = !DILocation(line: 10, column: 13, scope: !1132)
!1148 = !DILocalVariable(name: "error", arg: 1, scope: !1149, file: !269, line: 17, type: !1109)
!1149 = distinct !DISubprogram(name: "jsonp_error_set_source", scope: !269, file: !269, line: 17, type: !1107, scopeLine: 17, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !268, retainedNodes: !1150)
!1150 = !{!1148, !1151, !1152, !1153}
!1151 = !DILocalVariable(name: "source", arg: 2, scope: !1149, file: !269, line: 17, type: !177)
!1152 = !DILocalVariable(name: "length", scope: !1149, file: !269, line: 18, type: !28)
!1153 = !DILocalVariable(name: "extra", scope: !1154, file: !269, line: 27, type: !28)
!1154 = distinct !DILexicalBlock(scope: !1155, file: !269, line: 26, column: 10)
!1155 = distinct !DILexicalBlock(scope: !1149, file: !269, line: 24, column: 9)
!1156 = !DILocation(line: 0, scope: !1149, inlinedAt: !1157)
!1157 = distinct !DILocation(line: 11, column: 13, scope: !1146)
!1158 = !DILocation(line: 23, column: 14, scope: !1149, inlinedAt: !1157)
!1159 = !DILocation(line: 24, column: 16, scope: !1155, inlinedAt: !1157)
!1160 = !DILocation(line: 24, column: 9, scope: !1149, inlinedAt: !1157)
!1161 = !DILocation(line: 25, column: 17, scope: !1155, inlinedAt: !1157)
!1162 = !DILocation(line: 25, column: 47, scope: !1155, inlinedAt: !1157)
!1163 = !DILocation(line: 25, column: 9, scope: !1155, inlinedAt: !1157)
!1164 = !DILocation(line: 27, column: 58, scope: !1154, inlinedAt: !1157)
!1165 = !DILocation(line: 0, scope: !1154, inlinedAt: !1157)
!1166 = !DILocation(line: 28, column: 9, scope: !1154, inlinedAt: !1157)
!1167 = !DILocation(line: 29, column: 31, scope: !1154, inlinedAt: !1157)
!1168 = !DILocation(line: 29, column: 43, scope: !1154, inlinedAt: !1157)
!1169 = !DILocation(line: 29, column: 9, scope: !1154, inlinedAt: !1157)
!1170 = !DILocation(line: 13, column: 13, scope: !1146)
!1171 = !DILocation(line: 13, column: 30, scope: !1146)
!1172 = !DILocation(line: 15, column: 1, scope: !1106)
!1173 = !DILocation(line: 0, scope: !1149)
!1174 = !DILocation(line: 20, column: 10, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1149, file: !269, line: 20, column: 9)
!1176 = !DILocation(line: 20, column: 16, scope: !1175)
!1177 = !DILocation(line: 23, column: 14, scope: !1149)
!1178 = !DILocation(line: 24, column: 16, scope: !1155)
!1179 = !DILocation(line: 24, column: 9, scope: !1149)
!1180 = !DILocation(line: 25, column: 17, scope: !1155)
!1181 = !DILocation(line: 25, column: 47, scope: !1155)
!1182 = !DILocation(line: 25, column: 9, scope: !1155)
!1183 = !DILocation(line: 27, column: 58, scope: !1154)
!1184 = !DILocation(line: 0, scope: !1154)
!1185 = !DILocation(line: 28, column: 9, scope: !1154)
!1186 = !DILocation(line: 29, column: 31, scope: !1154)
!1187 = !DILocation(line: 29, column: 43, scope: !1154)
!1188 = !DILocation(line: 29, column: 9, scope: !1154)
!1189 = !DILocation(line: 31, column: 1, scope: !1149)
!1190 = distinct !DISubprogram(name: "jsonp_error_set", scope: !269, file: !269, line: 33, type: !1191, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !268, retainedNodes: !1193)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{null, !1109, !46, !46, !28, !148, !177, null}
!1193 = !{!1194, !1195, !1196, !1197, !1198, !1199, !1200}
!1194 = !DILocalVariable(name: "error", arg: 1, scope: !1190, file: !269, line: 33, type: !1109)
!1195 = !DILocalVariable(name: "line", arg: 2, scope: !1190, file: !269, line: 33, type: !46)
!1196 = !DILocalVariable(name: "column", arg: 3, scope: !1190, file: !269, line: 33, type: !46)
!1197 = !DILocalVariable(name: "position", arg: 4, scope: !1190, file: !269, line: 33, type: !28)
!1198 = !DILocalVariable(name: "code", arg: 5, scope: !1190, file: !269, line: 34, type: !148)
!1199 = !DILocalVariable(name: "msg", arg: 6, scope: !1190, file: !269, line: 34, type: !177)
!1200 = !DILocalVariable(name: "ap", scope: !1190, file: !269, line: 35, type: !1201)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !98, line: 52, baseType: !1202)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1203, line: 32, baseType: !1204)
!1203 = !DIFile(filename: "node_modules/llvm-14.0.0.obj/lib/clang/14.0.0/include/stdarg.h", directory: "/home/kansx", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1205, baseType: !1206)
!1205 = !DIFile(filename: "error.c", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/jansson/jansson-2.14/src")
!1206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1207, size: 192, elements: !75)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1208)
!1208 = !{!1209, !1210, !1211, !1212}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1207, file: !1205, line: 35, baseType: !7, size: 32)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1207, file: !1205, line: 35, baseType: !7, size: 32, offset: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1207, file: !1205, line: 35, baseType: !18, size: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1207, file: !1205, line: 35, baseType: !18, size: 64, offset: 128)
!1213 = !DILocation(line: 0, scope: !1190)
!1214 = !DILocation(line: 35, column: 5, scope: !1190)
!1215 = !DILocation(line: 35, column: 13, scope: !1190)
!1216 = !DILocation(line: 37, column: 5, scope: !1190)
!1217 = !DILocalVariable(name: "error", arg: 1, scope: !1218, file: !269, line: 42, type: !1109)
!1218 = distinct !DISubprogram(name: "jsonp_error_vset", scope: !269, file: !269, line: 42, type: !1219, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !268, retainedNodes: !1222)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{null, !1109, !46, !46, !28, !148, !177, !1221}
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1222 = !{!1217, !1223, !1224, !1225, !1226, !1227, !1228}
!1223 = !DILocalVariable(name: "line", arg: 2, scope: !1218, file: !269, line: 42, type: !46)
!1224 = !DILocalVariable(name: "column", arg: 3, scope: !1218, file: !269, line: 42, type: !46)
!1225 = !DILocalVariable(name: "position", arg: 4, scope: !1218, file: !269, line: 42, type: !28)
!1226 = !DILocalVariable(name: "code", arg: 5, scope: !1218, file: !269, line: 43, type: !148)
!1227 = !DILocalVariable(name: "msg", arg: 6, scope: !1218, file: !269, line: 43, type: !177)
!1228 = !DILocalVariable(name: "ap", arg: 7, scope: !1218, file: !269, line: 43, type: !1221)
!1229 = !DILocation(line: 0, scope: !1218, inlinedAt: !1230)
!1230 = distinct !DILocation(line: 38, column: 5, scope: !1190)
!1231 = !DILocation(line: 44, column: 10, scope: !1232, inlinedAt: !1230)
!1232 = distinct !DILexicalBlock(scope: !1218, file: !269, line: 44, column: 9)
!1233 = !DILocation(line: 44, column: 9, scope: !1218, inlinedAt: !1230)
!1234 = !DILocation(line: 47, column: 9, scope: !1235, inlinedAt: !1230)
!1235 = distinct !DILexicalBlock(scope: !1218, file: !269, line: 47, column: 9)
!1236 = !DILocation(line: 47, column: 24, scope: !1235, inlinedAt: !1230)
!1237 = !DILocation(line: 47, column: 9, scope: !1218, inlinedAt: !1230)
!1238 = !DILocation(line: 52, column: 12, scope: !1218, inlinedAt: !1230)
!1239 = !DILocation(line: 52, column: 17, scope: !1218, inlinedAt: !1230)
!1240 = !DILocation(line: 53, column: 12, scope: !1218, inlinedAt: !1230)
!1241 = !DILocation(line: 53, column: 19, scope: !1218, inlinedAt: !1230)
!1242 = !DILocation(line: 54, column: 23, scope: !1218, inlinedAt: !1230)
!1243 = !DILocation(line: 54, column: 12, scope: !1218, inlinedAt: !1230)
!1244 = !DILocation(line: 54, column: 21, scope: !1218, inlinedAt: !1230)
!1245 = !DILocation(line: 56, column: 5, scope: !1218, inlinedAt: !1230)
!1246 = !DILocation(line: 57, column: 5, scope: !1218, inlinedAt: !1230)
!1247 = !DILocation(line: 57, column: 45, scope: !1218, inlinedAt: !1230)
