; ModuleID = '.file.o.bc'
source_filename = "file.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.anon.1 = type { i8*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.anon.3 = type { i8*, i64, i64, i8*, i32, i32 }
%struct.magic_set = type { [2 x %struct.mlist*], %struct.cont, %struct.out, i32, i32, i32, i32, i32, i8*, i64, i32, %struct.anon.0, %union.VALUETYPE, i16, i16, i16, i16, i16, i16, i64, i64, i64, %struct.__locale_struct* }
%struct.mlist = type { %struct.magic*, %struct.re_pattern_buffer**, i64, i8*, %struct.mlist*, %struct.mlist* }
%struct.magic = type { i16, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, i32, %union.anon, %union.VALUETYPE, [64 x i8], [80 x i8], [8 x i8], [64 x i8] }
%union.anon = type { i64 }
%struct.re_pattern_buffer = type { %struct.re_dfa_t*, i64, i64, i64, i8*, i8*, i64, i8 }
%struct.re_dfa_t = type opaque
%struct.cont = type { i64, %struct.level_info* }
%struct.level_info = type { i32, i32, i32, i32 }
%struct.out = type { i8*, i64, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "rcsid", scope: !2, file: !3, line: 35, type: !73, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !19, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "file.c", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/libmagic/file-5.45/src", checksumkind: CSK_MD5, checksum: "d0fd7e2bdbe0aa8dc27a2c38cb2ce018")
!4 = !{!5, !6, !9, !11, !13, !14, !15, !16}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 46, baseType: !8)
!7 = !DIFile(filename: "node_modules/llvm-14.0.0.obj/lib/clang/14.0.0/include/stddef.h", directory: "/home/kansx", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!8 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !12, line: 90, baseType: !8)
!12 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!15 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !17, line: 20, baseType: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !{!0, !20, !22, !26, !40, !42, !44, !54, !56, !58, !60}
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "posixly", scope: !2, file: !3, line: 171, type: !13, isLocal: true, isDefinition: true)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "file_progname", scope: !2, file: !3, line: 786, type: !24, isLocal: true, isDefinition: true)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 107, type: !28, isLocal: true, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 7936, elements: !38)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !31, line: 50, size: 256, elements: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!32 = !{!33, !34, !35, !37}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !30, file: !31, line: 52, baseType: !24, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !30, file: !31, line: 55, baseType: !13, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !30, file: !31, line: 56, baseType: !36, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !30, file: !31, line: 57, baseType: !13, size: 32, offset: 192)
!38 = !{!39}
!39 = !DISubrange(count: 31)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "nulsep", scope: !2, file: !3, line: 104, type: !13, isLocal: true, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "bflag", scope: !2, file: !3, line: 101, type: !13, isLocal: true, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "nv", scope: !2, file: !3, line: 127, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 1664, elements: !52)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 124, size: 128, elements: !49)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !48, file: !3, line: 125, baseType: !24, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !48, file: !3, line: 126, baseType: !13, size: 32, offset: 64)
!52 = !{!53}
!53 = !DISubrange(count: 13)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "separator", scope: !2, file: !3, line: 106, type: !24, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "nobuffer", scope: !2, file: !3, line: 103, type: !13, isLocal: true, isDefinition: true)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "nopad", scope: !2, file: !3, line: 102, type: !13, isLocal: true, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "pm", scope: !2, file: !3, line: 150, type: !62, isLocal: true, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 2880, elements: !71)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 143, size: 320, elements: !64)
!64 = !{!65, !66, !67, !68, !69, !70}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !63, file: !3, line: 144, baseType: !24, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !63, file: !3, line: 145, baseType: !6, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !63, file: !3, line: 146, baseType: !6, size: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !63, file: !3, line: 147, baseType: !24, size: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !63, file: !3, line: 148, baseType: !13, size: 32, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !63, file: !3, line: 149, baseType: !13, size: 32, offset: 288)
!71 = !{!72}
!72 = !DISubrange(count: 9)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 488, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 61)
!76 = !{i32 7, !"Dwarf Version", i32 5}
!77 = !{i32 2, !"Debug Info Version", i32 3}
!78 = !{i32 1, !"wchar_size", i32 4}
!79 = !{i32 7, !"PIC Level", i32 2}
!80 = !{i32 7, !"uwtable", i32 1}
!81 = !{!"clang version 14.0.0"}
!82 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 194, type: !83, scopeLine: 195, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !85)
!83 = !DISubroutineType(types: !84)
!84 = !{!13, !13, !14}
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !289, !290, !291, !292}
!86 = !DILocalVariable(name: "argc", arg: 1, scope: !82, file: !3, line: 194, type: !13)
!87 = !DILocalVariable(name: "argv", arg: 2, scope: !82, file: !3, line: 194, type: !14)
!88 = !DILocalVariable(name: "c", scope: !82, file: !3, line: 196, type: !13)
!89 = !DILocalVariable(name: "i", scope: !82, file: !3, line: 197, type: !6)
!90 = !DILocalVariable(name: "j", scope: !82, file: !3, line: 197, type: !6)
!91 = !DILocalVariable(name: "wid", scope: !82, file: !3, line: 197, type: !6)
!92 = !DILocalVariable(name: "nw", scope: !82, file: !3, line: 197, type: !6)
!93 = !DILocalVariable(name: "action", scope: !82, file: !3, line: 198, type: !13)
!94 = !DILocalVariable(name: "didsomefiles", scope: !82, file: !3, line: 198, type: !13)
!95 = !DILocalVariable(name: "errflg", scope: !82, file: !3, line: 198, type: !13)
!96 = !DILocalVariable(name: "flags", scope: !82, file: !3, line: 199, type: !13)
!97 = !DILocalVariable(name: "e", scope: !82, file: !3, line: 199, type: !13)
!98 = !DILocalVariable(name: "magic", scope: !82, file: !3, line: 203, type: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "magic_set", file: !101, line: 455, size: 2496, elements: !102)
!101 = !DIFile(filename: "./file.h", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/libmagic/file-5.45/src", checksumkind: CSK_MD5, checksum: "73737282a91c9a166137ffd3c170ad6a")
!102 = !{!103, !222, !234, !240, !241, !242, !243, !244, !245, !246, !247, !251, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "mlist", scope: !100, file: !101, line: 456, baseType: !104, size: 128)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 128, elements: !158)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mlist", file: !101, line: 421, size: 384, elements: !107)
!107 = !{!108, !191, !218, !219, !220, !221}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !106, file: !101, line: 422, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "magic", file: !101, line: 209, size: 3008, elements: !111)
!111 = !{!112, !118, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !134, !135, !138, !149, !180, !184, !188, !190}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "cont_level", scope: !110, file: !101, line: 211, baseType: !113, size: 16)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !114, line: 25, baseType: !115)
!114 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !116, line: 40, baseType: !117)
!116 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!117 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !110, file: !101, line: 212, baseType: !119, size: 8, offset: 16)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !114, line: 24, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !116, line: 38, baseType: !15)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !110, file: !101, line: 223, baseType: !119, size: 8, offset: 24)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "reln", scope: !110, file: !101, line: 226, baseType: !119, size: 8, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "vallen", scope: !110, file: !101, line: 227, baseType: !119, size: 8, offset: 40)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !110, file: !101, line: 228, baseType: !119, size: 8, offset: 48)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "in_type", scope: !110, file: !101, line: 229, baseType: !119, size: 8, offset: 56)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "in_op", scope: !110, file: !101, line: 312, baseType: !119, size: 8, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "mask_op", scope: !110, file: !101, line: 313, baseType: !119, size: 8, offset: 72)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !110, file: !101, line: 315, baseType: !119, size: 8, offset: 80)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "factor_op", scope: !110, file: !101, line: 319, baseType: !119, size: 8, offset: 88)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !110, file: !101, line: 350, baseType: !131, size: 32, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !132, line: 26, baseType: !133)
!132 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !116, line: 41, baseType: !13)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "in_offset", scope: !110, file: !101, line: 352, baseType: !131, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !110, file: !101, line: 354, baseType: !136, size: 32, offset: 160)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !114, line: 26, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !116, line: 42, baseType: !18)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_u", scope: !110, file: !101, line: 362, baseType: !139, size: 64, offset: 192)
!139 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !110, file: !101, line: 356, size: 64, elements: !140)
!140 = !{!141, !144}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_mask", scope: !139, file: !101, line: 357, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !114, line: 27, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !116, line: 45, baseType: !8)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_s", scope: !139, file: !101, line: 361, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !139, file: !101, line: 358, size: 64, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_count", scope: !145, file: !101, line: 359, baseType: !136, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !145, file: !101, line: 360, baseType: !136, size: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !110, file: !101, line: 367, baseType: !150, size: 1024, offset: 256)
!150 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "VALUETYPE", file: !101, line: 194, size: 1024, elements: !151)
!151 = !{!152, !153, !154, !155, !156, !160, !164, !168, !172, !174, !176, !178}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !150, file: !101, line: 195, baseType: !119, size: 8)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !150, file: !101, line: 196, baseType: !113, size: 16)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !150, file: !101, line: 197, baseType: !136, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !150, file: !101, line: 198, baseType: !142, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "hs", scope: !150, file: !101, line: 199, baseType: !157, size: 16)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 16, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 2)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "hl", scope: !150, file: !101, line: 200, baseType: !161, size: 32)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 4)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "hq", scope: !150, file: !101, line: 201, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 64, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 8)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !150, file: !101, line: 202, baseType: !169, size: 1024)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !150, file: !101, line: 203, baseType: !173, size: 1024)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 1024, elements: !170)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !150, file: !101, line: 204, baseType: !175, size: 128)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 128, elements: !158)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !150, file: !101, line: 205, baseType: !177, size: 32)
!177 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !150, file: !101, line: 206, baseType: !179, size: 64)
!179 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !110, file: !101, line: 369, baseType: !181, size: 512, offset: 1280)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 512, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mimetype", scope: !110, file: !101, line: 371, baseType: !185, size: 640, offset: 1792)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 640, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 80)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "apple", scope: !110, file: !101, line: 373, baseType: !189, size: 64, offset: 2432)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !166)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !110, file: !101, line: 375, baseType: !181, size: 512, offset: 2496)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "magic_rxcomp", scope: !106, file: !101, line: 423, baseType: !192, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "file_regex_t", file: !101, line: 182, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "regex_t", file: !196, line: 478, baseType: !197)
!196 = !DIFile(filename: "/usr/include/regex.h", directory: "", checksumkind: CSK_MD5, checksum: "6d816f6cca462fea1b68ba10523ed664")
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !196, line: 413, size: 512, elements: !198)
!198 = !{!199, !202, !204, !205, !207, !208, !210, !211, !212, !213, !214, !215, !216, !217}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !197, file: !196, line: 417, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !196, line: 417, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !197, file: !196, line: 420, baseType: !203, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !196, line: 56, baseType: !8)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !197, file: !196, line: 423, baseType: !203, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !197, file: !196, line: 426, baseType: !206, size: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !196, line: 72, baseType: !8)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !197, file: !196, line: 431, baseType: !9, size: 64, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !197, file: !196, line: 437, baseType: !209, size: 64, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !197, file: !196, line: 440, baseType: !6, size: 64, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !197, file: !196, line: 446, baseType: !18, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !197, file: !196, line: 457, baseType: !18, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !197, file: !196, line: 461, baseType: !18, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !197, file: !196, line: 465, baseType: !18, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !197, file: !196, line: 469, baseType: !18, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !197, file: !196, line: 472, baseType: !18, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !197, file: !196, line: 475, baseType: !18, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "nmagic", scope: !106, file: !101, line: 424, baseType: !6, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !106, file: !101, line: 425, baseType: !5, size: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !106, file: !101, line: 426, baseType: !105, size: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !106, file: !101, line: 426, baseType: !105, size: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !100, file: !101, line: 457, baseType: !223, size: 128, offset: 128)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cont", file: !101, line: 448, size: 128, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !223, file: !101, line: 449, baseType: !6, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "li", scope: !223, file: !101, line: 450, baseType: !227, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "level_info", file: !101, line: 439, size: 128, elements: !229)
!229 = !{!230, !231, !232, !233}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !228, file: !101, line: 440, baseType: !131, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "got_match", scope: !228, file: !101, line: 441, baseType: !13, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "last_match", scope: !228, file: !101, line: 443, baseType: !13, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "last_cond", scope: !228, file: !101, line: 444, baseType: !13, size: 32, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !100, file: !101, line: 462, baseType: !235, size: 192, offset: 256)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "out", file: !101, line: 458, size: 192, elements: !236)
!236 = !{!237, !238, !239}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !235, file: !101, line: 459, baseType: !9, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "blen", scope: !235, file: !101, line: 460, baseType: !6, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pbuf", scope: !235, file: !101, line: 461, baseType: !9, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !100, file: !101, line: 463, baseType: !136, size: 32, offset: 448)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "eoffset", scope: !100, file: !101, line: 465, baseType: !136, size: 32, offset: 480)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !100, file: !101, line: 466, baseType: !13, size: 32, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !100, file: !101, line: 467, baseType: !13, size: 32, offset: 544)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "event_flags", scope: !100, file: !101, line: 468, baseType: !13, size: 32, offset: 576)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !100, file: !101, line: 470, baseType: !24, size: 64, offset: 640)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !100, file: !101, line: 471, baseType: !6, size: 64, offset: 704)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !100, file: !101, line: 472, baseType: !248, size: 32, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !249, line: 50, baseType: !250)
!249 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !116, line: 150, baseType: !18)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "search", scope: !100, file: !101, line: 480, baseType: !252, size: 256, offset: 832)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !100, file: !101, line: 475, size: 256, elements: !253)
!253 = !{!254, !255, !256, !257}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !252, file: !101, line: 476, baseType: !24, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "s_len", scope: !252, file: !101, line: 477, baseType: !6, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !252, file: !101, line: 478, baseType: !6, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "rm_len", scope: !252, file: !101, line: 479, baseType: !6, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ms_value", scope: !100, file: !101, line: 484, baseType: !150, size: 1024, offset: 1088)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "indir_max", scope: !100, file: !101, line: 485, baseType: !113, size: 16, offset: 2112)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "name_max", scope: !100, file: !101, line: 486, baseType: !113, size: 16, offset: 2128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "elf_shnum_max", scope: !100, file: !101, line: 487, baseType: !113, size: 16, offset: 2144)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "elf_phnum_max", scope: !100, file: !101, line: 488, baseType: !113, size: 16, offset: 2160)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "elf_notes_max", scope: !100, file: !101, line: 489, baseType: !113, size: 16, offset: 2176)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "regex_max", scope: !100, file: !101, line: 490, baseType: !113, size: 16, offset: 2192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_max", scope: !100, file: !101, line: 491, baseType: !6, size: 64, offset: 2240)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "encoding_max", scope: !100, file: !101, line: 492, baseType: !6, size: 64, offset: 2304)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "elf_shsize_max", scope: !100, file: !101, line: 493, baseType: !6, size: 64, offset: 2368)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "c_lc_ctype", scope: !100, file: !101, line: 507, baseType: !269, size: 64, offset: 2432)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !270, line: 24, baseType: !271)
!270 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "4752f26e930c42056083e96227ff0057")
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !272, line: 41, baseType: !273)
!272 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "79eea70c97dfcbc51f94cdf9446ea8a8")
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !272, line: 27, size: 1856, elements: !275)
!275 = !{!276, !280, !283, !286, !287}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !274, file: !272, line: 30, baseType: !277, size: 832)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 832, elements: !52)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !272, line: 30, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !274, file: !272, line: 33, baseType: !281, size: 64, offset: 832)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !274, file: !272, line: 34, baseType: !284, size: 64, offset: 896)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !274, file: !272, line: 35, baseType: !284, size: 64, offset: 960)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !274, file: !272, line: 38, baseType: !288, size: 832, offset: 1024)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 832, elements: !52)
!289 = !DILocalVariable(name: "longindex", scope: !82, file: !3, line: 204, type: !13)
!290 = !DILocalVariable(name: "magicfile", scope: !82, file: !3, line: 205, type: !24)
!291 = !DILocalVariable(name: "progname", scope: !82, file: !3, line: 206, type: !9)
!292 = !DILabel(scope: !82, name: "out", file: !3, line: 445)
!293 = !DILocation(line: 195, scope: !82)
!294 = !{}
!295 = !DILocation(line: 0, scope: !82)
!296 = !DILocation(line: 204, column: 2, scope: !82)
!297 = !DILocation(line: 209, column: 8, scope: !82)
!298 = !DILocation(line: 216, column: 26, scope: !299)
!299 = distinct !DILexicalBlock(scope: !82, file: !3, line: 216, column: 6)
!300 = !{!301, !301, i64 0}
!301 = !{!"any pointer", !302, i64 0}
!302 = !{!"omnipotent char", !303, i64 0}
!303 = !{!"Simple C/C++ TBAA"}
!304 = !DILocation(line: 216, column: 18, scope: !299)
!305 = !DILocation(line: 216, column: 41, scope: !299)
!306 = !DILocation(line: 216, column: 6, scope: !82)
!307 = !DILocalVariable(name: "progname", arg: 1, scope: !308, file: !3, line: 789, type: !24)
!308 = distinct !DISubprogram(name: "file_setprogname", scope: !3, file: !3, line: 789, type: !309, scopeLine: 790, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !311)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !24}
!311 = !{!307}
!312 = !DILocation(line: 0, scope: !308, inlinedAt: !313)
!313 = distinct !DILocation(line: 221, column: 2, scope: !82)
!314 = !DILocation(line: 791, column: 16, scope: !308, inlinedAt: !313)
!315 = !DILocation(line: 225, column: 12, scope: !82)
!316 = !DILocation(line: 225, column: 38, scope: !82)
!317 = !DILocation(line: 225, column: 10, scope: !82)
!318 = !{!319, !319, i64 0}
!319 = !{!"int", !302, i64 0}
!320 = !DILocation(line: 226, column: 12, scope: !82)
!321 = !DILocation(line: 228, column: 2, scope: !82)
!322 = !DILocation(line: 198, column: 6, scope: !82)
!323 = !DILocation(line: 198, column: 18, scope: !82)
!324 = !DILocation(line: 226, column: 8, scope: !82)
!325 = !DILocation(line: 199, column: 17, scope: !82)
!326 = !DILocation(line: 203, column: 20, scope: !82)
!327 = !DILocation(line: 205, column: 14, scope: !82)
!328 = !DILocation(line: 228, column: 14, scope: !82)
!329 = !DILocation(line: 772, column: 7, scope: !330, inlinedAt: !333)
!330 = distinct !DISubprogram(name: "help", scope: !3, file: !3, line: 767, type: !331, scopeLine: 768, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !294)
!331 = !DISubroutineType(types: !332)
!332 = !{null}
!333 = distinct !DILocation(line: 232, column: 4, scope: !334)
!334 = distinct !DILexicalBlock(scope: !82, file: !3, line: 230, column: 14)
!335 = !DILocation(line: 769, column: 8, scope: !330, inlinedAt: !333)
!336 = !DILocation(line: 18, column: 1, scope: !337, inlinedAt: !333)
!337 = !DILexicalBlockFile(scope: !330, file: !338, discriminator: 0)
!338 = !DIFile(filename: "./file_opts.h", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/libmagic/file-5.45/src", checksumkind: CSK_MD5, checksum: "f15c0ef0e592f6d0cafef25248b96502")
!339 = !DILocation(line: 20, column: 1, scope: !337, inlinedAt: !333)
!340 = !DILocation(line: 22, column: 1, scope: !337, inlinedAt: !333)
!341 = !DILocation(line: 25, column: 1, scope: !337, inlinedAt: !333)
!342 = !DILocation(line: 27, column: 1, scope: !337, inlinedAt: !333)
!343 = !DILocation(line: 29, column: 1, scope: !337, inlinedAt: !333)
!344 = !DILocation(line: 31, column: 1, scope: !337, inlinedAt: !333)
!345 = !DILocation(line: 35, column: 1, scope: !337, inlinedAt: !333)
!346 = !DILocation(line: 39, column: 1, scope: !337, inlinedAt: !333)
!347 = !DILocation(line: 41, column: 1, scope: !337, inlinedAt: !333)
!348 = !DILocation(line: 43, column: 1, scope: !337, inlinedAt: !333)
!349 = !DILocation(line: 45, column: 1, scope: !337, inlinedAt: !333)
!350 = !DILocation(line: 48, column: 1, scope: !337, inlinedAt: !333)
!351 = !DILocation(line: 50, column: 1, scope: !337, inlinedAt: !333)
!352 = !DILocation(line: 52, column: 1, scope: !337, inlinedAt: !333)
!353 = !DILocation(line: 54, column: 1, scope: !337, inlinedAt: !333)
!354 = !DILocation(line: 56, column: 1, scope: !337, inlinedAt: !333)
!355 = !DILocation(line: 58, column: 1, scope: !337, inlinedAt: !333)
!356 = !DILocation(line: 61, column: 1, scope: !337, inlinedAt: !333)
!357 = !DILocation(line: 63, column: 1, scope: !337, inlinedAt: !333)
!358 = !DILocation(line: 66, column: 1, scope: !337, inlinedAt: !333)
!359 = !DILocation(line: 68, column: 1, scope: !337, inlinedAt: !333)
!360 = !DILocation(line: 70, column: 1, scope: !337, inlinedAt: !333)
!361 = !DILocation(line: 73, column: 1, scope: !337, inlinedAt: !333)
!362 = !DILocation(line: 76, column: 1, scope: !337, inlinedAt: !333)
!363 = !DILocation(line: 79, column: 1, scope: !337, inlinedAt: !333)
!364 = !DILocation(line: 81, column: 1, scope: !337, inlinedAt: !333)
!365 = !DILocation(line: 84, column: 1, scope: !337, inlinedAt: !333)
!366 = !DILocation(line: 86, column: 1, scope: !337, inlinedAt: !333)
!367 = !DILocation(line: 88, column: 1, scope: !337, inlinedAt: !333)
!368 = !DILocation(line: 782, column: 8, scope: !369, inlinedAt: !333)
!369 = !DILexicalBlockFile(scope: !330, file: !3, discriminator: 0)
!370 = !DILocation(line: 783, column: 2, scope: !369, inlinedAt: !333)
!371 = !DILocation(line: 235, column: 10, scope: !334)
!372 = !DILocation(line: 236, column: 4, scope: !334)
!373 = !DILocation(line: 238, column: 10, scope: !334)
!374 = !DILocation(line: 239, column: 4, scope: !334)
!375 = !DILocation(line: 241, column: 10, scope: !334)
!376 = !DILocation(line: 242, column: 4, scope: !334)
!377 = !DILocation(line: 244, column: 10, scope: !334)
!378 = !DILocation(line: 245, column: 4, scope: !334)
!379 = !DILocation(line: 247, column: 10, scope: !334)
!380 = !DILocation(line: 248, column: 4, scope: !334)
!381 = !DILocation(line: 250, column: 9, scope: !334)
!382 = !DILocation(line: 251, column: 4, scope: !334)
!383 = !DILocation(line: 254, column: 4, scope: !334)
!384 = !DILocation(line: 257, column: 4, scope: !334)
!385 = !DILocation(line: 259, column: 10, scope: !334)
!386 = !DILocation(line: 260, column: 4, scope: !334)
!387 = !DILocation(line: 262, column: 10, scope: !334)
!388 = !DILocation(line: 263, column: 4, scope: !334)
!389 = !DILocation(line: 267, column: 9, scope: !390)
!390 = distinct !DILexicalBlock(scope: !391, file: !3, line: 267, column: 9)
!391 = distinct !DILexicalBlock(scope: !392, file: !3, line: 266, column: 4)
!392 = distinct !DILexicalBlock(scope: !334, file: !3, line: 266, column: 4)
!393 = !DILocation(line: 267, column: 36, scope: !390)
!394 = !DILocation(line: 267, column: 9, scope: !391)
!395 = !DILocation(line: 271, column: 11, scope: !396)
!396 = distinct !DILexicalBlock(scope: !397, file: !3, line: 271, column: 9)
!397 = distinct !DILexicalBlock(scope: !398, file: !3, line: 270, column: 31)
!398 = distinct !DILexicalBlock(scope: !334, file: !3, line: 270, column: 8)
!399 = !DILocation(line: 271, column: 9, scope: !397)
!400 = distinct !{!400, !321, !401, !402}
!401 = !DILocation(line: 357, column: 3, scope: !82)
!402 = !{!"llvm.loop.mustprogress"}
!403 = !DILocation(line: 274, column: 20, scope: !398)
!404 = !{!405, !319, i64 8}
!405 = !{!"", !301, i64 0, !319, i64 8}
!406 = !DILocation(line: 274, column: 11, scope: !398)
!407 = !DILocation(line: 278, column: 7, scope: !408)
!408 = distinct !DILexicalBlock(scope: !334, file: !3, line: 278, column: 7)
!409 = !DILocation(line: 278, column: 7, scope: !334)
!410 = !DILocation(line: 797, column: 9, scope: !411, inlinedAt: !414)
!411 = distinct !DISubprogram(name: "file_getprogname", scope: !3, file: !3, line: 795, type: !412, scopeLine: 796, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !294)
!412 = !DISubroutineType(types: !413)
!413 = !{!24}
!414 = distinct !DILocation(line: 703, column: 19, scope: !415, inlinedAt: !418)
!415 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 701, type: !331, scopeLine: 702, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !416)
!416 = !{!417}
!417 = !DILocalVariable(name: "pn", scope: !415, file: !3, line: 703, type: !24)
!418 = distinct !DILocation(line: 279, column: 5, scope: !408)
!419 = !DILocation(line: 0, scope: !415, inlinedAt: !418)
!420 = !DILocation(line: 704, column: 16, scope: !415, inlinedAt: !418)
!421 = !DILocation(line: 704, column: 8, scope: !415, inlinedAt: !418)
!422 = !DILocation(line: 705, column: 2, scope: !415, inlinedAt: !418)
!423 = !DILocation(line: 280, column: 14, scope: !424)
!424 = distinct !DILexicalBlock(scope: !334, file: !3, line: 280, column: 8)
!425 = !DILocation(line: 280, column: 8, scope: !334)
!426 = !DILocation(line: 281, column: 18, scope: !427)
!427 = distinct !DILexicalBlock(scope: !424, file: !3, line: 281, column: 9)
!428 = !DILocation(line: 281, column: 42, scope: !427)
!429 = !DILocation(line: 281, column: 9, scope: !424)
!430 = !DILocation(line: 283, column: 4, scope: !334)
!431 = !DILocation(line: 284, column: 23, scope: !334)
!432 = !DILocalVariable(name: "ms", arg: 1, scope: !433, file: !3, line: 512, type: !99)
!433 = distinct !DISubprogram(name: "unwrap", scope: !3, file: !3, line: 512, type: !434, scopeLine: 513, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !436)
!434 = !DISubroutineType(types: !435)
!435 = !{!13, !99, !24}
!436 = !{!432, !437, !438, !493, !497, !498, !499, !500, !501, !502, !503, !504, !505}
!437 = !DILocalVariable(name: "fn", arg: 2, scope: !433, file: !3, line: 512, type: !24)
!438 = !DILocalVariable(name: "f", scope: !433, file: !3, line: 514, type: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !441, line: 7, baseType: !442)
!441 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !443, line: 49, size: 1728, elements: !444)
!443 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!444 = !{!445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !460, !462, !463, !464, !467, !468, !470, !474, !477, !479, !482, !485, !486, !487, !488, !489}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !442, file: !443, line: 51, baseType: !13, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !442, file: !443, line: 54, baseType: !9, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !442, file: !443, line: 55, baseType: !9, size: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !442, file: !443, line: 56, baseType: !9, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !442, file: !443, line: 57, baseType: !9, size: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !442, file: !443, line: 58, baseType: !9, size: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !442, file: !443, line: 59, baseType: !9, size: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !442, file: !443, line: 60, baseType: !9, size: 64, offset: 448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !442, file: !443, line: 61, baseType: !9, size: 64, offset: 512)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !442, file: !443, line: 64, baseType: !9, size: 64, offset: 576)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !442, file: !443, line: 65, baseType: !9, size: 64, offset: 640)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !442, file: !443, line: 66, baseType: !9, size: 64, offset: 704)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !442, file: !443, line: 68, baseType: !458, size: 64, offset: 768)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !443, line: 36, flags: DIFlagFwdDecl)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !442, file: !443, line: 70, baseType: !461, size: 64, offset: 832)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !442, file: !443, line: 72, baseType: !13, size: 32, offset: 896)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !442, file: !443, line: 73, baseType: !13, size: 32, offset: 928)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !442, file: !443, line: 74, baseType: !465, size: 64, offset: 960)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !116, line: 152, baseType: !466)
!466 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !442, file: !443, line: 77, baseType: !117, size: 16, offset: 1024)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !442, file: !443, line: 78, baseType: !469, size: 8, offset: 1040)
!469 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !442, file: !443, line: 79, baseType: !471, size: 8, offset: 1048)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 1)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !442, file: !443, line: 81, baseType: !475, size: 64, offset: 1088)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !443, line: 43, baseType: null)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !442, file: !443, line: 89, baseType: !478, size: 64, offset: 1152)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !116, line: 153, baseType: !466)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !442, file: !443, line: 91, baseType: !480, size: 64, offset: 1216)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !443, line: 37, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !442, file: !443, line: 92, baseType: !483, size: 64, offset: 1280)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !443, line: 38, flags: DIFlagFwdDecl)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !442, file: !443, line: 93, baseType: !461, size: 64, offset: 1344)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !442, file: !443, line: 94, baseType: !5, size: 64, offset: 1408)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !442, file: !443, line: 95, baseType: !6, size: 64, offset: 1472)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !442, file: !443, line: 96, baseType: !13, size: 32, offset: 1536)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !442, file: !443, line: 98, baseType: !490, size: 160, offset: 1568)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 160, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 20)
!493 = !DILocalVariable(name: "len", scope: !433, file: !3, line: 515, type: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !495, line: 77, baseType: !496)
!495 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !116, line: 194, baseType: !466)
!497 = !DILocalVariable(name: "line", scope: !433, file: !3, line: 516, type: !9)
!498 = !DILocalVariable(name: "llen", scope: !433, file: !3, line: 517, type: !6)
!499 = !DILocalVariable(name: "wid", scope: !433, file: !3, line: 518, type: !13)
!500 = !DILocalVariable(name: "cwid", scope: !433, file: !3, line: 518, type: !13)
!501 = !DILocalVariable(name: "e", scope: !433, file: !3, line: 519, type: !13)
!502 = !DILocalVariable(name: "fi", scope: !433, file: !3, line: 520, type: !6)
!503 = !DILocalVariable(name: "fimax", scope: !433, file: !3, line: 520, type: !6)
!504 = !DILocalVariable(name: "flist", scope: !433, file: !3, line: 521, type: !14)
!505 = !DILocalVariable(name: "nf", scope: !506, file: !3, line: 547, type: !14)
!506 = distinct !DILexicalBlock(scope: !507, file: !3, line: 545, column: 20)
!507 = distinct !DILexicalBlock(scope: !508, file: !3, line: 545, column: 7)
!508 = distinct !DILexicalBlock(scope: !433, file: !3, line: 532, column: 47)
!509 = !DILocation(line: 0, scope: !433, inlinedAt: !510)
!510 = distinct !DILocation(line: 284, column: 9, scope: !334)
!511 = !DILocation(line: 516, column: 2, scope: !433, inlinedAt: !510)
!512 = !DILocation(line: 516, column: 8, scope: !433, inlinedAt: !510)
!513 = !DILocation(line: 517, column: 2, scope: !433, inlinedAt: !510)
!514 = !DILocation(line: 517, column: 9, scope: !433, inlinedAt: !510)
!515 = !{!516, !516, i64 0}
!516 = !{!"long", !302, i64 0}
!517 = !DILocation(line: 523, column: 6, scope: !518, inlinedAt: !510)
!518 = distinct !DILexicalBlock(scope: !433, file: !3, line: 523, column: 6)
!519 = !DILocation(line: 523, column: 22, scope: !518, inlinedAt: !510)
!520 = !DILocation(line: 523, column: 6, scope: !433, inlinedAt: !510)
!521 = !DILocation(line: 524, column: 7, scope: !518, inlinedAt: !510)
!522 = !DILocation(line: 524, column: 3, scope: !518, inlinedAt: !510)
!523 = !DILocation(line: 526, column: 12, scope: !524, inlinedAt: !510)
!524 = distinct !DILexicalBlock(scope: !525, file: !3, line: 526, column: 7)
!525 = distinct !DILexicalBlock(scope: !518, file: !3, line: 525, column: 7)
!526 = !DILocation(line: 526, column: 28, scope: !524, inlinedAt: !510)
!527 = !DILocation(line: 526, column: 7, scope: !525, inlinedAt: !510)
!528 = !DILocation(line: 527, column: 4, scope: !529, inlinedAt: !510)
!529 = distinct !DILexicalBlock(scope: !524, file: !3, line: 526, column: 37)
!530 = !DILocation(line: 528, column: 4, scope: !529, inlinedAt: !510)
!531 = !DILocation(line: 0, scope: !518, inlinedAt: !510)
!532 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !533, file: !534, line: 118, type: !14)
!533 = distinct !DISubprogram(name: "getline", scope: !534, file: !534, line: 118, type: !535, scopeLine: 119, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !538)
!534 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!535 = !DISubroutineType(types: !536)
!536 = !{!496, !14, !537, !439}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!538 = !{!532, !539, !540}
!539 = !DILocalVariable(name: "__n", arg: 2, scope: !533, file: !534, line: 118, type: !537)
!540 = !DILocalVariable(name: "__stream", arg: 3, scope: !533, file: !534, line: 118, type: !439)
!541 = !DILocation(line: 0, scope: !533, inlinedAt: !542)
!542 = distinct !DILocation(line: 532, column: 16, scope: !433, inlinedAt: !510)
!543 = !DILocation(line: 120, column: 10, scope: !533, inlinedAt: !542)
!544 = !DILocation(line: 532, column: 42, scope: !433, inlinedAt: !510)
!545 = !DILocation(line: 532, column: 2, scope: !433, inlinedAt: !510)
!546 = !DILocation(line: 533, column: 7, scope: !547, inlinedAt: !510)
!547 = distinct !DILexicalBlock(scope: !508, file: !3, line: 533, column: 7)
!548 = !DILocation(line: 533, column: 16, scope: !547, inlinedAt: !510)
!549 = !{!302, !302, i64 0}
!550 = !DILocation(line: 533, column: 21, scope: !547, inlinedAt: !510)
!551 = !DILocation(line: 533, column: 7, scope: !508, inlinedAt: !510)
!552 = !DILocation(line: 534, column: 18, scope: !547, inlinedAt: !510)
!553 = !DILocation(line: 535, column: 28, scope: !508, inlinedAt: !510)
!554 = !DILocation(line: 534, column: 4, scope: !547, inlinedAt: !510)
!555 = !DILocation(line: 535, column: 10, scope: !508, inlinedAt: !510)
!556 = !DILocation(line: 536, column: 7, scope: !557, inlinedAt: !510)
!557 = distinct !DILexicalBlock(scope: !508, file: !3, line: 536, column: 7)
!558 = !DILocation(line: 536, column: 7, scope: !508, inlinedAt: !510)
!559 = !DILocation(line: 537, column: 21, scope: !560, inlinedAt: !510)
!560 = distinct !DILexicalBlock(scope: !557, file: !3, line: 536, column: 17)
!561 = !DILocation(line: 537, column: 9, scope: !560, inlinedAt: !510)
!562 = !DILocation(line: 537, column: 6, scope: !560, inlinedAt: !510)
!563 = !DILocation(line: 538, column: 9, scope: !560, inlinedAt: !510)
!564 = !DILocation(line: 538, column: 4, scope: !560, inlinedAt: !510)
!565 = !DILocation(line: 539, column: 9, scope: !560, inlinedAt: !510)
!566 = !DILocation(line: 540, column: 9, scope: !560, inlinedAt: !510)
!567 = distinct !{!567, !545, !568, !402}
!568 = !DILocation(line: 558, column: 2, scope: !433, inlinedAt: !510)
!569 = !DILocation(line: 543, column: 12, scope: !570, inlinedAt: !510)
!570 = distinct !DILexicalBlock(scope: !508, file: !3, line: 543, column: 7)
!571 = !DILocation(line: 543, column: 7, scope: !508, inlinedAt: !510)
!572 = !DILocation(line: 545, column: 10, scope: !507, inlinedAt: !510)
!573 = !DILocation(line: 545, column: 7, scope: !508, inlinedAt: !510)
!574 = !DILocation(line: 546, column: 10, scope: !506, inlinedAt: !510)
!575 = !DILocation(line: 547, column: 16, scope: !506, inlinedAt: !510)
!576 = !DILocation(line: 0, scope: !506, inlinedAt: !510)
!577 = !DILocation(line: 549, column: 11, scope: !578, inlinedAt: !510)
!578 = distinct !DILexicalBlock(scope: !506, file: !3, line: 549, column: 8)
!579 = !DILocation(line: 549, column: 8, scope: !506, inlinedAt: !510)
!580 = !DILocation(line: 550, column: 5, scope: !581, inlinedAt: !510)
!581 = distinct !DILexicalBlock(scope: !578, file: !3, line: 549, column: 20)
!582 = !DILocation(line: 554, column: 3, scope: !506, inlinedAt: !510)
!583 = !DILocation(line: 555, column: 17, scope: !508, inlinedAt: !510)
!584 = !DILocation(line: 555, column: 11, scope: !508, inlinedAt: !510)
!585 = !DILocation(line: 555, column: 3, scope: !508, inlinedAt: !510)
!586 = !DILocation(line: 555, column: 15, scope: !508, inlinedAt: !510)
!587 = !DILocation(line: 556, column: 8, scope: !508, inlinedAt: !510)
!588 = !DILocation(line: 557, column: 8, scope: !508, inlinedAt: !510)
!589 = distinct !{!589, !545, !568, !402}
!590 = !DILocation(line: 560, column: 7, scope: !591, inlinedAt: !510)
!591 = distinct !DILexicalBlock(scope: !433, file: !3, line: 560, column: 6)
!592 = !DILocation(line: 560, column: 6, scope: !433, inlinedAt: !510)
!593 = !DILocation(line: 563, column: 21, scope: !594, inlinedAt: !510)
!594 = distinct !DILexicalBlock(scope: !595, file: !3, line: 562, column: 34)
!595 = distinct !DILexicalBlock(scope: !596, file: !3, line: 562, column: 3)
!596 = distinct !DILexicalBlock(scope: !597, file: !3, line: 562, column: 3)
!597 = distinct !DILexicalBlock(scope: !591, file: !3, line: 560, column: 17)
!598 = !DILocation(line: 563, column: 9, scope: !594, inlinedAt: !510)
!599 = !DILocation(line: 563, column: 6, scope: !594, inlinedAt: !510)
!600 = !DILocation(line: 564, column: 9, scope: !594, inlinedAt: !510)
!601 = !DILocation(line: 564, column: 4, scope: !594, inlinedAt: !510)
!602 = !DILocation(line: 562, column: 30, scope: !595, inlinedAt: !510)
!603 = !DILocation(line: 562, column: 19, scope: !595, inlinedAt: !510)
!604 = !DILocation(line: 562, column: 3, scope: !596, inlinedAt: !510)
!605 = distinct !{!605, !604, !606, !402}
!606 = !DILocation(line: 565, column: 3, scope: !596, inlinedAt: !510)
!607 = !DILocation(line: 519, column: 6, scope: !433, inlinedAt: !510)
!608 = !DILocation(line: 567, column: 7, scope: !433, inlinedAt: !510)
!609 = !DILocation(line: 567, column: 2, scope: !433, inlinedAt: !510)
!610 = !DILocation(line: 569, column: 11, scope: !611, inlinedAt: !510)
!611 = distinct !DILexicalBlock(scope: !433, file: !3, line: 569, column: 6)
!612 = !DILocation(line: 569, column: 8, scope: !611, inlinedAt: !510)
!613 = !DILocation(line: 569, column: 6, scope: !433, inlinedAt: !510)
!614 = !DILocation(line: 570, column: 9, scope: !611, inlinedAt: !510)
!615 = !DILocation(line: 570, column: 3, scope: !611, inlinedAt: !510)
!616 = !DILocation(line: 572, column: 1, scope: !433, inlinedAt: !510)
!617 = !DILocation(line: 284, column: 6, scope: !334)
!618 = !DILocation(line: 285, column: 4, scope: !334)
!619 = !DILocation(line: 286, column: 4, scope: !334)
!620 = !DILocation(line: 288, column: 16, scope: !334)
!621 = !DILocation(line: 288, column: 14, scope: !334)
!622 = !DILocation(line: 289, column: 4, scope: !334)
!623 = !DILocation(line: 291, column: 10, scope: !334)
!624 = !DILocation(line: 292, column: 4, scope: !334)
!625 = !DILocation(line: 294, column: 10, scope: !334)
!626 = !DILocation(line: 295, column: 4, scope: !334)
!627 = !DILocation(line: 298, column: 4, scope: !334)
!628 = !DILocation(line: 300, column: 16, scope: !334)
!629 = !DILocation(line: 301, column: 4, scope: !334)
!630 = !DILocation(line: 303, column: 4, scope: !334)
!631 = !DILocation(line: 304, column: 4, scope: !334)
!632 = !DILocation(line: 306, column: 4, scope: !334)
!633 = !DILocation(line: 307, column: 4, scope: !334)
!634 = !DILocation(line: 310, column: 10, scope: !334)
!635 = !DILocation(line: 311, column: 4, scope: !334)
!636 = !DILocation(line: 314, column: 13, scope: !334)
!637 = !DILocalVariable(name: "p", arg: 1, scope: !638, file: !3, line: 468, type: !24)
!638 = distinct !DISubprogram(name: "setparam", scope: !3, file: !3, line: 468, type: !309, scopeLine: 469, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !639)
!639 = !{!637, !640, !641, !642}
!640 = !DILocalVariable(name: "i", scope: !638, file: !3, line: 470, type: !6)
!641 = !DILocalVariable(name: "s", scope: !638, file: !3, line: 471, type: !9)
!642 = !DILabel(scope: !638, name: "badparm", file: !3, line: 483)
!643 = !DILocation(line: 0, scope: !638, inlinedAt: !644)
!644 = distinct !DILocation(line: 314, column: 4, scope: !334)
!645 = !DILocation(line: 473, column: 11, scope: !646, inlinedAt: !644)
!646 = distinct !DILexicalBlock(scope: !638, file: !3, line: 473, column: 6)
!647 = !DILocation(line: 473, column: 42, scope: !646, inlinedAt: !644)
!648 = !DILocation(line: 473, column: 6, scope: !638, inlinedAt: !644)
!649 = !DILocation(line: 477, column: 24, scope: !650, inlinedAt: !644)
!650 = distinct !DILexicalBlock(scope: !651, file: !3, line: 477, column: 7)
!651 = distinct !DILexicalBlock(scope: !652, file: !3, line: 476, column: 41)
!652 = distinct !DILexicalBlock(scope: !653, file: !3, line: 476, column: 2)
!653 = distinct !DILexicalBlock(scope: !638, file: !3, line: 476, column: 2)
!654 = !{!655, !301, i64 0}
!655 = !{!"", !301, i64 0, !516, i64 8, !516, i64 16, !301, i64 24, !319, i64 32, !319, i64 36}
!656 = !DILocation(line: 477, column: 7, scope: !650, inlinedAt: !644)
!657 = !DILocation(line: 477, column: 37, scope: !650, inlinedAt: !644)
!658 = !DILocation(line: 477, column: 7, scope: !651, inlinedAt: !644)
!659 = !DILocation(line: 483, column: 1, scope: !638, inlinedAt: !644)
!660 = !DILocation(line: 484, column: 2, scope: !638, inlinedAt: !644)
!661 = !DILocation(line: 479, column: 24, scope: !651, inlinedAt: !644)
!662 = !DILocalVariable(name: "__nptr", arg: 1, scope: !663, file: !664, line: 362, type: !24)
!663 = distinct !DISubprogram(name: "atoi", scope: !664, file: !664, line: 362, type: !665, scopeLine: 363, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !667)
!664 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!665 = !DISubroutineType(types: !666)
!666 = !{!13, !24}
!667 = !{!662}
!668 = !DILocation(line: 0, scope: !663, inlinedAt: !669)
!669 = distinct !DILocation(line: 479, column: 17, scope: !651, inlinedAt: !644)
!670 = !DILocation(line: 364, column: 16, scope: !663, inlinedAt: !669)
!671 = !DILocation(line: 479, column: 17, scope: !651, inlinedAt: !644)
!672 = !DILocation(line: 479, column: 9, scope: !651, inlinedAt: !644)
!673 = !DILocation(line: 479, column: 15, scope: !651, inlinedAt: !644)
!674 = !{!655, !516, i64 8}
!675 = !DILocation(line: 480, column: 9, scope: !651, inlinedAt: !644)
!676 = !DILocation(line: 480, column: 13, scope: !651, inlinedAt: !644)
!677 = !{!655, !319, i64 36}
!678 = !DILocation(line: 315, column: 4, scope: !334)
!679 = !DILocation(line: 317, column: 10, scope: !334)
!680 = !DILocation(line: 318, column: 4, scope: !334)
!681 = !DILocation(line: 320, column: 10, scope: !334)
!682 = !DILocation(line: 321, column: 4, scope: !334)
!683 = !DILocation(line: 328, column: 18, scope: !684)
!684 = distinct !DILexicalBlock(scope: !334, file: !3, line: 328, column: 8)
!685 = !DILocation(line: 328, column: 8, scope: !334)
!686 = !DILocation(line: 329, column: 17, scope: !684)
!687 = !DILocation(line: 329, column: 5, scope: !684)
!688 = !DILocation(line: 330, column: 18, scope: !334)
!689 = !DILocation(line: 797, column: 9, scope: !411, inlinedAt: !690)
!690 = distinct !DILocation(line: 330, column: 37, scope: !334)
!691 = !DILocation(line: 330, column: 10, scope: !334)
!692 = !DILocation(line: 332, column: 18, scope: !334)
!693 = !DILocation(line: 332, column: 10, scope: !334)
!694 = !DILocation(line: 337, column: 4, scope: !334)
!695 = !DILocation(line: 339, column: 10, scope: !334)
!696 = !DILocation(line: 340, column: 4, scope: !334)
!697 = !DILocation(line: 343, column: 10, scope: !334)
!698 = !DILocation(line: 344, column: 4, scope: !334)
!699 = !DILocation(line: 347, column: 10, scope: !334)
!700 = !DILocation(line: 348, column: 4, scope: !334)
!701 = !DILocation(line: 350, column: 10, scope: !334)
!702 = !DILocation(line: 351, column: 4, scope: !334)
!703 = !DILocation(line: 355, column: 10, scope: !334)
!704 = !DILocation(line: 356, column: 4, scope: !334)
!705 = !DILocation(line: 359, column: 6, scope: !706)
!706 = distinct !DILexicalBlock(scope: !82, file: !3, line: 359, column: 6)
!707 = !DILocation(line: 359, column: 6, scope: !82)
!708 = !DILocation(line: 797, column: 9, scope: !411, inlinedAt: !709)
!709 = distinct !DILocation(line: 703, column: 19, scope: !415, inlinedAt: !710)
!710 = distinct !DILocation(line: 360, column: 3, scope: !711)
!711 = distinct !DILexicalBlock(scope: !706, file: !3, line: 359, column: 14)
!712 = !DILocation(line: 0, scope: !415, inlinedAt: !710)
!713 = !DILocation(line: 704, column: 16, scope: !415, inlinedAt: !710)
!714 = !DILocation(line: 704, column: 8, scope: !415, inlinedAt: !710)
!715 = !DILocation(line: 705, column: 2, scope: !415, inlinedAt: !710)
!716 = !DILocation(line: 362, column: 6, scope: !717)
!717 = distinct !DILexicalBlock(scope: !82, file: !3, line: 362, column: 6)
!718 = !DILocation(line: 362, column: 6, scope: !82)
!719 = !DILocation(line: 376, column: 23, scope: !720)
!720 = distinct !DILexicalBlock(scope: !82, file: !3, line: 376, column: 6)
!721 = !DILocation(line: 376, column: 20, scope: !720)
!722 = !DILocation(line: 376, column: 6, scope: !82)
!723 = !DILocation(line: 379, column: 22, scope: !720)
!724 = !DILocation(line: 377, column: 3, scope: !720)
!725 = !DILocation(line: 381, column: 2, scope: !82)
!726 = !DILocation(line: 389, column: 27, scope: !727)
!727 = distinct !DILexicalBlock(scope: !82, file: !3, line: 381, column: 17)
!728 = !DILocation(line: 389, column: 11, scope: !727)
!729 = !DILocation(line: 390, column: 13, scope: !730)
!730 = distinct !DILexicalBlock(scope: !727, file: !3, line: 390, column: 7)
!731 = !DILocation(line: 390, column: 7, scope: !727)
!732 = !DILocation(line: 391, column: 4, scope: !733)
!733 = distinct !DILexicalBlock(scope: !730, file: !3, line: 390, column: 22)
!734 = !DILocation(line: 392, column: 4, scope: !733)
!735 = !DILocation(line: 396, column: 3, scope: !727)
!736 = !DILocation(line: 398, column: 8, scope: !737)
!737 = distinct !DILexicalBlock(scope: !727, file: !3, line: 396, column: 18)
!738 = !DILocation(line: 399, column: 4, scope: !737)
!739 = !DILocation(line: 401, column: 8, scope: !737)
!740 = !DILocation(line: 402, column: 4, scope: !737)
!741 = !DILocation(line: 404, column: 8, scope: !737)
!742 = !DILocation(line: 405, column: 4, scope: !737)
!743 = !DILocation(line: 407, column: 4, scope: !737)
!744 = !DILocation(line: 0, scope: !737)
!745 = !DILocation(line: 409, column: 9, scope: !746)
!746 = distinct !DILexicalBlock(scope: !727, file: !3, line: 409, column: 7)
!747 = !DILocation(line: 409, column: 7, scope: !727)
!748 = !DILocation(line: 410, column: 21, scope: !749)
!749 = distinct !DILexicalBlock(scope: !746, file: !3, line: 409, column: 16)
!750 = !DILocation(line: 410, column: 4, scope: !749)
!751 = !DILocation(line: 412, column: 4, scope: !749)
!752 = !DILocation(line: 416, column: 13, scope: !753)
!753 = distinct !DILexicalBlock(scope: !727, file: !3, line: 416, column: 7)
!754 = !DILocation(line: 416, column: 7, scope: !727)
!755 = !DILocation(line: 417, column: 17, scope: !756)
!756 = distinct !DILexicalBlock(scope: !753, file: !3, line: 417, column: 8)
!757 = !DILocation(line: 417, column: 41, scope: !756)
!758 = !DILocation(line: 417, column: 8, scope: !753)
!759 = !DILocation(line: 419, column: 3, scope: !727)
!760 = !DILocation(line: 422, column: 6, scope: !761)
!761 = distinct !DILexicalBlock(scope: !82, file: !3, line: 422, column: 6)
!762 = !DILocation(line: 422, column: 13, scope: !761)
!763 = !DILocation(line: 422, column: 6, scope: !82)
!764 = !DILocation(line: 423, column: 8, scope: !765)
!765 = distinct !DILexicalBlock(scope: !766, file: !3, line: 423, column: 7)
!766 = distinct !DILexicalBlock(scope: !761, file: !3, line: 422, column: 22)
!767 = !DILocation(line: 423, column: 7, scope: !766)
!768 = !DILocation(line: 424, column: 4, scope: !765)
!769 = !DILocation(line: 428, column: 44, scope: !770)
!770 = distinct !DILexicalBlock(scope: !771, file: !3, line: 428, column: 2)
!771 = distinct !DILexicalBlock(scope: !82, file: !3, line: 428, column: 2)
!772 = !DILocation(line: 428, column: 2, scope: !771)
!773 = !DILocation(line: 428, column: 20, scope: !771)
!774 = !DILocation(line: 430, column: 29, scope: !775)
!775 = distinct !DILexicalBlock(scope: !770, file: !3, line: 429, column: 11)
!776 = !DILocation(line: 430, column: 8, scope: !775)
!777 = !DILocation(line: 431, column: 10, scope: !778)
!778 = distinct !DILexicalBlock(scope: !775, file: !3, line: 431, column: 7)
!779 = !DILocation(line: 431, column: 7, scope: !775)
!780 = !DILocation(line: 429, column: 7, scope: !770)
!781 = distinct !{!781, !772, !782, !402}
!782 = !DILocation(line: 433, column: 2, scope: !771)
!783 = !DILocation(line: 439, column: 6, scope: !784)
!784 = distinct !DILexicalBlock(scope: !82, file: !3, line: 439, column: 6)
!785 = !DILocation(line: 439, column: 12, scope: !784)
!786 = !DILocation(line: 439, column: 6, scope: !82)
!787 = !DILocation(line: 440, column: 26, scope: !788)
!788 = distinct !DILexicalBlock(scope: !784, file: !3, line: 439, column: 18)
!789 = !DILocation(line: 440, column: 18, scope: !788)
!790 = !DILocation(line: 440, column: 9, scope: !788)
!791 = !DILocation(line: 441, column: 2, scope: !788)
!792 = !DILocation(line: 442, column: 16, scope: !793)
!793 = distinct !DILexicalBlock(scope: !794, file: !3, line: 442, column: 2)
!794 = distinct !DILexicalBlock(scope: !82, file: !3, line: 442, column: 2)
!795 = !DILocation(line: 442, column: 2, scope: !794)
!796 = !DILocation(line: 443, column: 23, scope: !793)
!797 = !DILocation(line: 443, column: 8, scope: !793)
!798 = !DILocation(line: 443, column: 5, scope: !793)
!799 = !DILocation(line: 442, column: 30, scope: !793)
!800 = distinct !{!800, !795, !801, !402}
!801 = !DILocation(line: 443, column: 40, scope: !794)
!802 = !DILocation(line: 0, scope: !727)
!803 = !DILocation(line: 445, column: 1, scope: !82)
!804 = !DILocation(line: 446, column: 7, scope: !805)
!805 = distinct !DILexicalBlock(scope: !82, file: !3, line: 446, column: 6)
!806 = !DILocation(line: 446, column: 6, scope: !82)
!807 = !DILocation(line: 447, column: 15, scope: !805)
!808 = !DILocation(line: 447, column: 8, scope: !805)
!809 = !DILocation(line: 447, column: 23, scope: !805)
!810 = !DILocation(line: 447, column: 5, scope: !805)
!811 = !DILocation(line: 447, column: 3, scope: !805)
!812 = !DILocation(line: 449, column: 6, scope: !813)
!813 = distinct !DILexicalBlock(scope: !82, file: !3, line: 449, column: 6)
!814 = !DILocation(line: 449, column: 6, scope: !82)
!815 = !DILocation(line: 450, column: 3, scope: !813)
!816 = !DILocation(line: 452, column: 1, scope: !82)
!817 = !DISubprogram(name: "setlocale", scope: !818, file: !818, line: 122, type: !819, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !294)
!818 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!819 = !DISubroutineType(types: !820)
!820 = !{!9, !13, !24}
!821 = !DILocation(line: 790, scope: !308)
!822 = !DILocation(line: 0, scope: !308)
!823 = !DILocation(line: 791, column: 16, scope: !308)
!824 = !DILocation(line: 792, column: 1, scope: !308)
!825 = !DISubprogram(name: "getenv", scope: !664, file: !664, line: 641, type: !826, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !294)
!826 = !DISubroutineType(types: !827)
!827 = !{!9, !24}
!828 = !DISubprogram(name: "getopt_long", scope: !31, file: !31, line: 66, type: !829, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !294)
!829 = !DISubroutineType(types: !830)
!830 = !{!13, !13, !831, !24, !833, !36}
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!834 = !DILocation(line: 797, column: 9, scope: !411, inlinedAt: !835)
!835 = distinct !DILocation(line: 703, column: 19, scope: !415)
!836 = !DILocation(line: 0, scope: !415)
!837 = !DILocation(line: 704, column: 16, scope: !415)
!838 = !DILocation(line: 704, column: 8, scope: !415)
!839 = !DILocation(line: 705, column: 2, scope: !415)
!840 = distinct !DISubprogram(name: "load", scope: !3, file: !3, line: 489, type: !841, scopeLine: 490, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !843)
!841 = !DISubroutineType(types: !842)
!842 = !{!99, !24, !13}
!843 = !{!844, !845, !846, !847}
!844 = !DILocalVariable(name: "magicfile", arg: 1, scope: !840, file: !3, line: 489, type: !24)
!845 = !DILocalVariable(name: "flags", arg: 2, scope: !840, file: !3, line: 489, type: !13)
!846 = !DILocalVariable(name: "magic", scope: !840, file: !3, line: 491, type: !99)
!847 = !DILocalVariable(name: "e", scope: !840, file: !3, line: 492, type: !24)
!848 = !DILocation(line: 490, scope: !840)
!849 = !DILocation(line: 0, scope: !840)
!850 = !DILocation(line: 491, column: 28, scope: !840)
!851 = !DILocation(line: 494, column: 12, scope: !852)
!852 = distinct !DILexicalBlock(scope: !840, file: !3, line: 494, column: 6)
!853 = !DILocation(line: 494, column: 6, scope: !840)
!854 = !DILocation(line: 495, column: 3, scope: !855)
!855 = distinct !DILexicalBlock(scope: !852, file: !3, line: 494, column: 21)
!856 = !DILocation(line: 496, column: 3, scope: !855)
!857 = !DILocation(line: 498, column: 6, scope: !858)
!858 = distinct !DILexicalBlock(scope: !840, file: !3, line: 498, column: 6)
!859 = !DILocation(line: 498, column: 35, scope: !858)
!860 = !DILocation(line: 498, column: 6, scope: !840)
!861 = !DILocation(line: 499, column: 3, scope: !862)
!862 = distinct !DILexicalBlock(scope: !858, file: !3, line: 498, column: 42)
!863 = !DILocation(line: 500, column: 3, scope: !862)
!864 = !DILocation(line: 501, column: 3, scope: !862)
!865 = !DILocation(line: 503, column: 31, scope: !866)
!866 = distinct !DILexicalBlock(scope: !840, file: !3, line: 503, column: 6)
!867 = !DILocation(line: 503, column: 6, scope: !840)
!868 = !DILocation(line: 504, column: 3, scope: !866)
!869 = !DILocation(line: 506, column: 1, scope: !840)
!870 = distinct !DISubprogram(name: "applyparam", scope: !3, file: !3, line: 455, type: !871, scopeLine: 456, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !875)
!871 = !DISubroutineType(types: !872)
!872 = !{null, !873}
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "magic_t", file: !874, line: 127, baseType: !99)
!874 = !DIFile(filename: "./magic.h", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/libmagic/file-5.45/src", checksumkind: CSK_MD5, checksum: "3e7d21936a6fef94001f63ddebb8a897")
!875 = !{!876, !877}
!876 = !DILocalVariable(name: "magic", arg: 1, scope: !870, file: !3, line: 455, type: !873)
!877 = !DILocalVariable(name: "i", scope: !870, file: !3, line: 457, type: !6)
!878 = !DILocation(line: 456, scope: !870)
!879 = !DILocation(line: 0, scope: !870)
!880 = !DILocation(line: 460, column: 14, scope: !881)
!881 = distinct !DILexicalBlock(scope: !882, file: !3, line: 460, column: 7)
!882 = distinct !DILexicalBlock(scope: !883, file: !3, line: 459, column: 41)
!883 = distinct !DILexicalBlock(scope: !884, file: !3, line: 459, column: 2)
!884 = distinct !DILexicalBlock(scope: !870, file: !3, line: 459, column: 2)
!885 = !DILocation(line: 460, column: 8, scope: !881)
!886 = !DILocation(line: 460, column: 7, scope: !882)
!887 = !DILocation(line: 462, column: 35, scope: !888)
!888 = distinct !DILexicalBlock(scope: !882, file: !3, line: 462, column: 7)
!889 = !{!655, !319, i64 32}
!890 = !DILocation(line: 462, column: 7, scope: !888)
!891 = !DILocation(line: 462, column: 54, scope: !888)
!892 = !DILocation(line: 462, column: 7, scope: !882)
!893 = !DILocation(line: 463, column: 49, scope: !888)
!894 = !DILocation(line: 463, column: 4, scope: !888)
!895 = !DILocation(line: 465, column: 1, scope: !870)
!896 = !DISubprogram(name: "magic_getpath", scope: !874, file: !874, line: 131, type: !897, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !294)
!897 = !DISubroutineType(types: !898)
!898 = !{!24, !24, !13}
!899 = !DILocation(line: 796, scope: !411)
!900 = !DILocation(line: 797, column: 9, scope: !411)
!901 = !DILocation(line: 797, column: 2, scope: !411)
!902 = !DISubprogram(name: "magic_version", scope: !874, file: !874, line: 140, type: !903, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !294)
!903 = !DISubroutineType(types: !904)
!904 = !{!13}
!905 = distinct !DISubprogram(name: "file_warnx", scope: !3, file: !3, line: 848, type: !906, scopeLine: 849, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !908)
!906 = !DISubroutineType(types: !907)
!907 = !{null, !24, null}
!908 = !{!909, !910, !923}
!909 = !DILocalVariable(name: "fmt", arg: 1, scope: !905, file: !3, line: 848, type: !24)
!910 = !DILocalVariable(name: "ap", scope: !905, file: !3, line: 850, type: !911)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !495, line: 52, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !913, line: 32, baseType: !914)
!913 = !DIFile(filename: "node_modules/llvm-14.0.0.obj/lib/clang/14.0.0/include/stdarg.h", directory: "/home/kansx", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !915, baseType: !916)
!915 = !DIFile(filename: "file.c", directory: "/home/kansx/Fuzz/APISpecFuzz/Library/libmagic/file-5.45/src")
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 192, elements: !472)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !918)
!918 = !{!919, !920, !921, !922}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !917, file: !915, line: 803, baseType: !18, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !917, file: !915, line: 803, baseType: !18, size: 32, offset: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !917, file: !915, line: 803, baseType: !5, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !917, file: !915, line: 803, baseType: !5, size: 64, offset: 128)
!923 = !DILocalVariable(name: "se", scope: !905, file: !3, line: 851, type: !13)
!924 = !DILocation(line: 849, scope: !905)
!925 = !DILocation(line: 0, scope: !905)
!926 = !DILocation(line: 850, column: 2, scope: !905)
!927 = !DILocation(line: 850, column: 10, scope: !905)
!928 = !DILocation(line: 851, column: 11, scope: !905)
!929 = !DILocation(line: 853, column: 2, scope: !905)
!930 = !DILocation(line: 854, column: 16, scope: !905)
!931 = !DILocation(line: 854, column: 32, scope: !905)
!932 = !DILocation(line: 854, column: 8, scope: !905)
!933 = !DILocation(line: 855, column: 17, scope: !905)
!934 = !DILocation(line: 855, column: 8, scope: !905)
!935 = !DILocation(line: 856, column: 2, scope: !905)
!936 = !DILocation(line: 857, column: 16, scope: !905)
!937 = !DILocation(line: 857, column: 8, scope: !905)
!938 = !DILocation(line: 858, column: 8, scope: !905)
!939 = !DILocation(line: 859, column: 1, scope: !905)
!940 = !DISubprogram(name: "magic_open", scope: !874, file: !874, line: 128, type: !941, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !294)
!941 = !DISubroutineType(types: !942)
!942 = !{!873, !13}
!943 = distinct !DISubprogram(name: "file_warn", scope: !3, file: !3, line: 831, type: !906, scopeLine: 832, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !944)
!944 = !{!945, !946, !947}
!945 = !DILocalVariable(name: "fmt", arg: 1, scope: !943, file: !3, line: 831, type: !24)
!946 = !DILocalVariable(name: "ap", scope: !943, file: !3, line: 833, type: !911)
!947 = !DILocalVariable(name: "se", scope: !943, file: !3, line: 834, type: !13)
!948 = !DILocation(line: 832, scope: !943)
!949 = !DILocation(line: 0, scope: !943)
!950 = !DILocation(line: 833, column: 2, scope: !943)
!951 = !DILocation(line: 833, column: 10, scope: !943)
!952 = !DILocation(line: 834, column: 11, scope: !943)
!953 = !DILocation(line: 836, column: 2, scope: !943)
!954 = !DILocation(line: 837, column: 16, scope: !943)
!955 = !DILocation(line: 837, column: 32, scope: !943)
!956 = !DILocation(line: 837, column: 8, scope: !943)
!957 = !DILocation(line: 838, column: 17, scope: !943)
!958 = !DILocation(line: 838, column: 8, scope: !943)
!959 = !DILocation(line: 839, column: 2, scope: !943)
!960 = !DILocation(line: 840, column: 6, scope: !961)
!961 = distinct !DILexicalBlock(scope: !943, file: !3, line: 840, column: 6)
!962 = !DILocation(line: 0, scope: !961)
!963 = !DILocation(line: 840, column: 6, scope: !943)
!964 = !DILocation(line: 841, column: 36, scope: !961)
!965 = !DILocation(line: 841, column: 9, scope: !961)
!966 = !DILocation(line: 841, column: 3, scope: !961)
!967 = !DILocation(line: 843, column: 3, scope: !961)
!968 = !DILocation(line: 844, column: 8, scope: !943)
!969 = !DILocation(line: 845, column: 1, scope: !943)
!970 = !DISubprogram(name: "magic_check", scope: !874, file: !874, line: 145, type: !971, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !294)
!971 = !DISubroutineType(types: !972)
!972 = !{!13, !873, !24}
!973 = !DISubprogram(name: "magic_compile", scope: !874, file: !874, line: 144, type: !971, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !294)
!974 = !DISubprogram(name: "magic_list", scope: !874, file: !874, line: 146, type: !971, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !294)
!975 = !DISubprogram(name: "magic_error", scope: !874, file: !874, line: 136, type: !976, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !294)
!976 = !DISubroutineType(types: !977)
!977 = !{!24, !873}
!978 = distinct !DISubprogram(name: "file_mbswidth", scope: !3, file: !3, line: 664, type: !979, scopeLine: 665, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !981)
!979 = !DISubroutineType(types: !980)
!980 = !{!6, !99, !24}
!981 = !{!982, !983, !984, !985, !986, !987, !1001, !1003}
!982 = !DILocalVariable(name: "ms", arg: 1, scope: !978, file: !3, line: 664, type: !99)
!983 = !DILocalVariable(name: "s", arg: 2, scope: !978, file: !3, line: 664, type: !24)
!984 = !DILocalVariable(name: "width", scope: !978, file: !3, line: 666, type: !6)
!985 = !DILocalVariable(name: "bytesconsumed", scope: !978, file: !3, line: 668, type: !6)
!986 = !DILocalVariable(name: "n", scope: !978, file: !3, line: 668, type: !6)
!987 = !DILocalVariable(name: "state", scope: !978, file: !3, line: 669, type: !988)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !989, line: 6, baseType: !990)
!989 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !991, line: 21, baseType: !992)
!991 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !991, line: 13, size: 64, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !992, file: !991, line: 15, baseType: !13, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !992, file: !991, line: 20, baseType: !996, size: 32, offset: 32)
!996 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !992, file: !991, line: 16, size: 32, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !996, file: !991, line: 18, baseType: !18, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !996, file: !991, line: 19, baseType: !1000, size: 32)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 32, elements: !162)
!1001 = !DILocalVariable(name: "nextchar", scope: !978, file: !3, line: 670, type: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !7, line: 74, baseType: !13)
!1003 = !DILocalVariable(name: "w", scope: !1004, file: !3, line: 684, type: !13)
!1004 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 683, column: 10)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 677, column: 7)
!1006 = distinct !DILexicalBlock(scope: !978, file: !3, line: 675, column: 16)
!1007 = !DILocation(line: 665, scope: !978)
!1008 = !DILocation(line: 0, scope: !978)
!1009 = !DILocation(line: 669, column: 2, scope: !978)
!1010 = !DILocation(line: 669, column: 12, scope: !978)
!1011 = !DILocation(line: 670, column: 2, scope: !978)
!1012 = !DILocation(line: 672, column: 8, scope: !978)
!1013 = !DILocation(line: 673, column: 6, scope: !978)
!1014 = !DILocation(line: 675, column: 11, scope: !978)
!1015 = !DILocation(line: 675, column: 2, scope: !978)
!1016 = !DILocation(line: 676, column: 19, scope: !1006)
!1017 = !DILocation(line: 677, column: 41, scope: !1005)
!1018 = !DILocation(line: 679, column: 15, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 678, column: 42)
!1020 = !DILocation(line: 679, column: 13, scope: !1019)
!1021 = !DILocation(line: 681, column: 10, scope: !1019)
!1022 = !DILocation(line: 683, column: 3, scope: !1019)
!1023 = !DILocation(line: 684, column: 20, scope: !1004)
!1024 = !DILocation(line: 684, column: 12, scope: !1004)
!1025 = !DILocation(line: 0, scope: !1004)
!1026 = !DILocation(line: 685, column: 19, scope: !1004)
!1027 = !{!1028, !319, i64 68}
!1028 = !{!"magic_set", !302, i64 0, !1029, i64 16, !1030, i64 32, !319, i64 56, !319, i64 60, !319, i64 64, !319, i64 68, !319, i64 72, !301, i64 80, !516, i64 88, !319, i64 96, !1031, i64 104, !302, i64 136, !1032, i64 264, !1032, i64 266, !1032, i64 268, !1032, i64 270, !1032, i64 272, !1032, i64 274, !516, i64 280, !516, i64 288, !516, i64 296, !301, i64 304}
!1029 = !{!"cont", !516, i64 0, !301, i64 8}
!1030 = !{!"out", !301, i64 0, !516, i64 8, !301, i64 16}
!1031 = !{!"", !301, i64 0, !516, i64 8, !516, i64 16, !516, i64 24}
!1032 = !{!"short", !302, i64 0}
!1033 = !DILocation(line: 685, column: 25, scope: !1004)
!1034 = !DILocation(line: 685, column: 38, scope: !1004)
!1035 = !DILocation(line: 686, column: 8, scope: !1004)
!1036 = !DILocation(line: 686, column: 20, scope: !1004)
!1037 = !DILocation(line: 686, column: 11, scope: !1004)
!1038 = !DILocation(line: 685, column: 13, scope: !1004)
!1039 = !DILocation(line: 686, column: 34, scope: !1004)
!1040 = !DILocation(line: 0, scope: !1006)
!1041 = !DILocation(line: 0, scope: !1005)
!1042 = !DILocation(line: 689, column: 5, scope: !1006)
!1043 = !DILocation(line: 689, column: 25, scope: !1006)
!1044 = distinct !{!1044, !1015, !1045, !402}
!1045 = !DILocation(line: 690, column: 2, scope: !978)
!1046 = !DILocation(line: 698, column: 1, scope: !978)
!1047 = !DILocation(line: 697, column: 2, scope: !978)
!1048 = distinct !DISubprogram(name: "process", scope: !3, file: !3, line: 630, type: !1049, scopeLine: 631, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1051)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!13, !99, !24, !13}
!1051 = !{!1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059}
